{
    "rank": "23",
    "title": "tonik",
    "company": "    Tonik Digital Bank",
    "url": "https://apps.apple.com/ph/app/tonik/id1541576007",
    "detail": {
        "description": "\n\nTonik is the Philippines' first neobank ﻿with a digital bank license offering the country’s highest savings interest rate—6% p.a.!\n\nInnovative. Passionate. Customer-first.\n\nWe are a transformative neobank (meaning 100% digital bank) and we're on a mission to revolutionize the way money works in Southeast Asia. Expect only fast, easy, and secure transactions with a team of experienced bankers taking care of your hard-earned savings. What every Filipino needs is a digital bank that’s approachable 24/7 and offers services that actually help us save. That’s Tonik.\n\nWith a strong desire to challenge the status quo in the world of finance, we’ve made it possible to give you a Time Deposit interest rate of 6% per annum – the highest in the Philippines. Our high interest rates and deposits are backed by the Bangko Sentral ng Pilipinas (BSP) and Philippine Deposit Insurance Corporation (PDIC). That's a promise you can bank on! We firmly believe you deserve a bank that loves you back like we do.\n\nOur Services:\nStash savings (solo and group), time deposits, virtual debit cards, physical Mastercard debit cards, loans and other transactions. It is an all-in-one app that will help you save money, create an online budget system, and access quick cash for your needs.\n\nTime Deposit\nEarn as high as 6% interest p.a. when you open a time deposit account.\n\nStash Savings\nSolo Stash: Open as many as five stashes for the things you’re saving up for and earn 4% interest p.a.\nGroup Stash: Like an online paluwagan, you can open a fund along with other people, pool your funds together, and earn 4.5% interest p.a.\n\nQuick Loan\nApply for fast and easy loans within 15 mins and get up to P50,000 into your Tonik Account immediately.\n\nShop Installment Loan (BETA)\nUpgrade your shopping experience with installments. Get a boost of up to P100,000 to your buying power with a simple application process and fast approval in 15 mins.\n\n\n        more\n      \n",
        "rating": "4.4"
    }
}