{
    "rank": "47",
    "title": "Wise",
    "company": "    Wise Payments Ltd",
    "url": "https://apps.apple.com/ph/app/wise/id612261027",
    "detail": {
        "description": "\n\nThe international account\n\nJoin over 10 million people and businesses, in more than 170 countries, who use Wise to send, spend, convert, and receive money internationally.\n\nWise is for anyone — travelers, immigrants, freelancers, organisations — whose money crosses borders. We’re 8x cheaper on average than leading UK banks. And a lot faster, too.\n\n— Cheaper and faster money transfers —\n• Send money to over 80 countries\n• For a super-low fee, you get the real exchange rate, like on Google, for every money transfer\n• 50% of transfers are instant or arrive within an hour\n• Secure your transfers with two-factor authentication\n\n— A debit card to spend worldwide —\n• Spend or withdraw money in more than 200 countries\n• If you don’t have the local currency, we’ll auto-convert what you have with the lowest possible price\n• Freeze and unfreeze your card, and update your virtual card whenever you like\n\n— Get paid with real account details —\n• Get your own UK account number and sort code, European IBAN, US routing and account numbers, and more. As if you had local bank accounts around the world.\n• Use these account details to get paid in multiple currencies for free, and for direct debits\n• Keep up-to-date with instant push notifications for every transaction\n\n— Hold 50+ currencies and convert between them instantly —\n• No monthly fee and no maintenance fee to keep money in your account, in most cases\n• Convert between currencies instantly, at the real exchange rate, for a super-low fee\n\n— A better business account for going global —\n• Pay invoices and bills faster, at a better exchange rate\n• Use account details to get paid by clients and customers around the world\n• Connect to supported platforms like Amazon, Stripe, Xero, and more\n\nWise is regulated by the FCA in the UK, and by other authorities around the world. Your money’s safe with us.\n\nSend from: GBP (British Pound), EUR (Euro), USD (US Dollar), AUD (Australian Dollar), BGN (Bulgarian Lev),  BRL (Brazilian Real), CAD (Canadian Dollar), CHF (Swiss Franc), CZK (Czech Koruna), DKK (Danish Krone), HKD (Hong Kong Dollar), HRK (Croatian Kuna), HUF (Hungarian Forint), JPY (Japanese Yen), NOK (Norwegian Krone), NZD (New Zealand Dollar), PLN (Polish Zloty), RON (New Romanian Leu), SEK (Swedish Krona), SGD (Singapore Dollar)\n\nSend to: EUR (Euro), USD (US Dollar), GBP (British Pound), AED (UAE Dirham), AUD (Australian Dollar), BDT (Bangladeshi Taka), BGN (Bulgarian Lev), BRL (Brazilian Real), CAD (Canadian Dollar), CHF (Swiss Franc), CLP (Chilean Peso), CNY (Chinese Yuan), CZK (Czech Koruna), DKK (Danish Krone), EGP (Egyptian Pound), GEL (Georgian Lari), HKD (Hong Kong Dollar), HRK (Croatian Kuna), HUF (Hungarian Forint), IDR (Indonesian Rupiah), ILS (Israeli Shekel), INR (Indian Rupee), JPY (Japanese Yen), KES (Kenyan Shilling), KRW (South Korean Won), LKR (Sri Lankan Rupee), MAD (Moroccan Dirham), MXN (Mexican Peso), MYR (Malaysian Ringgit), NOK (Norwegian Krone), NZD (New Zealand Dollar), PEN (Peruvian Nuevo Sol), PHP (Philippine Peso), PKR (Pakistan Rupee), PLN (Polish Zloty), RON (Romanian Leu), RUB (Russian Rouble), SEK (Swedish Krona), SGD (Singapore Dollar), THB (Thai Baht), TRY (Turkish Lira), UAH (Ukrainian Hryvnia), VND (Vietnamese Dong), ZAR (South African Rand)\n\n\n        more\n      \n",
        "rating": "4.6"
    }
}