{
    "rank": "80",
    "title": "DiskarTech",
    "company": "    Rizal Commercial Banking",
    "url": "https://apps.apple.com/ph/app/diskartech/id1510913146",
    "detail": {
        "description": "\n\nDigital savings account with bills payment, buy load and fund transfer on your phone!\n\nAng DiskarTech ay isang digital savings account na may iba’t ibang financial inclusion services para sama-sama tayo sa #BuhayGinhawa. Online lang ang account opening para ma-enjoy ang 3.25% annual interest sa savings, no initial deposit at maintaining balance. Free ang cash in, bills payment at fund transfer. Pwede ring mag-buy load, gaming pins, at bumili ng affordable telemedicine at insurance products! Meron na ring loans products para sa lahat ng Madiskarteng Pilipino! ‘Yun oh!\n\nPowered by RCBC, ang 2020 at 2021 Best Digital Bank of the Philippines, ay isang basic deposit account na pwedeng makuha in just few minutes using one valid ID. Halos lahat pwede rito dahil we accept 18 IDs!\n\n- Hindi kailangan ng existing RCBC account\n- Regulated ng BSP o Bangko Sentral ng Pilipinas\n- Insured ang savings ng PDIC o Philippine Deposit Insurance Corporation\n- Member ng BancNet\n\nSavings – Lamang ka rito!\n- Mag-avail ng mataas na interest rate na 3.25% kada taon\n\nDeposit at withdrawal – Kahit nasaan ka pa!\n- Mag-deposit at mag-withdraw ng pera sa 14,000+ partners namin\n- Free ang cash in sa 7-Eleven, Bayad Center, ECPay merchants gaya ng Petron, mga pawnshop gaya ng Tambunting, H Lhuillier, at iba pa.\n- Cardless naman ang pag-cash out via RCBC ATM withdrawal. Pwede na ring mag-cash out sa Bayad Center branches\n\nPay bills – Para hindi ma-late sa due date!\n- I-settle anytime, anywhere ang mga bayarain\n- Kuryente, tubig, insurance, credit card, telco at marami pang iba!\n\nLoan Products – Maaasahan ‘pag may kailangan!\n- Mamili ng swak na loan mula sa iba’t ibang partner-lenders\n- Merong motorcycle loan, auto loan, housing loan, doctor’s loan, at marami pang iba\n\nBuy load and e-Pins – ‘Di ka na mabibitin!\n- Bumili ng load or promos from Globe, TM, Smart, TNT at Sun Cellular\n- Bumili ng e-pins para sa mga paborito mong games online platforms gaya ng Mobile legends Bigo Live, iTunes, Nintendo, PlayStation, PUBG Mobile, Ragnarok Online, at XBOX. May e-pins din for Cignal!\n\nTransfer – Safe ang pera mo!\n- Magpadala o makatanggap ng pera sa family at friends, gamit ang phone mo lang\n- Free at unlimited ito buong 2021\n- Pwede sa mobile wallets gaya ng GCash at PayMaya at bangko gaya ng BDO, BPI, China Bank Corporation, Land Bank of the Philippines, Metrobank, Union Bank of the Philippines, atbp.\n- Gumagamit din ng QR PH ang DiskarTech kaya mas madali ang padala sa mga sumusunod: RCBC, Asia United Bank, Land Bank, Union Bank, China Bank at PayMaya, atbp.\n\nTelemedicine - Keep healthy!\n- Bumili ng telemedicine product para convenient at safe ang pag-konsulta sa doctor\n- May Telekonsulta which you can buy at P50 monthly! Abot kaya na, maaasahan pa sa panahong kailangan mo ng medical consultation, e-reseta, lab request at iba pa\n\nInsurance – Para sigurado ka!\n- For as low as P20, insured ka na!\n- Merong insurance products para sa mga laganap na sakit, dengue, sari-sari store owners, commuters, at riders\n- Galing sa Malayan Insurance\n\nBisitahin ang aming website: www.DiskarTech.ph\n\nI-follow kami sa social media.\n@DiskarTech sa Facebook, YouTube, Instagram, Twitter, LinkedIn\n\nPara sa iba pang impormasyon, tanong, o reklamo, puwedeng i-contact ang mga sumusunod:\n- DiskarTech Customer Care at help@DiskarTech.ph\n- BSP Consumer Protection Department at 8708-7087 o consumeraffairs@bsp.gov.ph\n\nSaan ka pa? Download na dis!\n\n\n        more\n      \n",
        "rating": "4.4"
    }
}