{
    "rank": "44",
    "title": "PesoQ",
    "company": "    U-PESO LENDING INVESTORS CORP.",
    "url": "https://apps.apple.com/ph/app/pesoq/id1563853842",
    "detail": {
        "description": "\n\nProduct introduction\nAge: Over 18\nLoan amount: ₱ 5,000.00 - ₱ 20,000.00\nLoan term: 96 days (shortest, including renewal time) - 365 days (longest, including renewal time)\nInterest rate: Maximum APR is 18% per year, 0.05% per day\nTransaction fee：0\nService fee: No other fees\nFor example: If you choose a loan limit of ₱ 6,000.00 with a period of 180 days,\nthe total interest must be paid: ₱ 6,000.00 * 0.05% * 180= ₱ 540.00, monthly interest shall be paid: ₱ 6,000.00 * 0.05% * 30 = ₱ 90.00，monthly repayment bill including principle and interest shall be paid: ₱ 6,000.00/6 + ₱ 90.00 = ₱ 1090.00，total repayment bill including principle and interest shall be paid: ₱ 6,000.00 + ₱ 540.00 = ₱ 6540.00\n\n\nPeso Loan / Peso Lending to your account (bank, e-wallet)\nUnsecured safe to get peso to your account (bank, e-wallet)\nOnline loan peso platform. Unsecured online loan, safely arrived. Staged shopping, zero mortgage to take home\n\nWhat is PesoQ?\nStill feeling uneasy about the mortgage of a capital peso lending peso? Dating money is not enough! Want to change your phone? Nothing to worry about now, PesoQ can solve all your problems for you. PesoQ, a platform dedicated to unsecured online loans with peso, can be ordered in stages, and can solve all your troubles because of money.\n\nWho can borrow?\nPesoQ is one of the earliest online lending platform in the Philippines. If you are over 18 years old, have a stable mobile number and a stable source of income, you can come to PesoQ to make a peso loan. We will increase the limit and loan period based on your credit score! The more data you provide, the higher your credit score. Borrowing takes only 4 steps:\ndownload the app PesoQ - Safe Loan and Peso Lending Online\nfill in the information\nwait for the review\nget your loan (bank transfer, e-wallet etc.)\n\nInstructions\nWe offer different amounts of services. Users can choose the money of peso in loan amount according to their individual needs.\nThe entire process is completed online, unsecured, to meet safe and secure loan funding needs.\n\n####Features####\n\nUnsecured\nPesoQ is a completely unsecured online peso lending platform. This means you don't need to provide any collateral. Only ID card loans are required.\n\nPrivacy and Security\nPesoQ protects all user information and we will not post your personal data to third parties without prior consent.\n\nAbout us\nHave problem to use PesoQ？\nPlease contact our online service for help:\nWorking time: 8:30 am – 17:30 pm (Monday - Saturday)\nPhone Globe: +639 271160484\nPhone Smart: +639 079839333\nWebsite: https://www.pesoq.com\nEmail: cs@pesoq.com\nOnline Customer Service: Open the app -> Mine -> Contact Us -> Online Customer Service\nAddress: 2nd Floor, Aseana Power Station, Macapagal Ave.,\ncor Bradco Ave., Tambo, CITY OF PARAnAQUE,\nNCR, FOURTH DISTRICT, Philippines\n\nCompany information:\nU-PESO LENDING INVESTORS CORP.\nCOMPANY REGISTRATION NO.CS201816691\nCERTIFICATE OF AUTHORITY NO.2739\n\n\n        more\n      \n",
        "rating": "4.3"
    }
}