{
    "rank": "20",
    "title": "Digido Philippines online loan",
    "company": "    Digido Finance Corp.",
    "url": "https://apps.apple.com/ph/app/digido-philippines-online-loan/id1592673583",
    "detail": {
        "description": "\n\n0% Interest fee Online loan for your first loan up to 10K PHP!\nOnline loans’ approval within 4 minutes!\nMeet DigiDo - your new trusted partner for cash loans on the quick loans market. With our personal loan app Philippines you can get fast loans via your mobile device!\nNew simple way to get loan online! Just enter the necessary data into the online application, the amount and the way you receive the money! Sign the contract through the code obtained by SMS!\n\nJust 1 Valid ID is all you need for applying loan! Fast online approval for loyal clients!\nYou can get a loan if:\n— A Filipino citizen, 21-70 years old and has a valid Government ID\n— Your mobile phone number is active\nFirst online loan can be between 1,000 PHP and 10,000 PHP. Loyal and repeating customers can take peso loan up to PHP 25,000 and repayment term can be stretched up to 180 Days.\nNote: You can get our Installment loan once you have already paid your first loan in full. Only repeat borrowers can avail our installment loan.\n\nMinimum APR: 0% (for first online peso loan only!)\nMaximum APR: 36%\nMinimum period: 90 days\nMaximum period: 180 days\n\nRepresentative example:\nThe interest rate for using the loan in the first 15 days (interest-free period) is 0% per day (0% per annum), for the next 165 days, a floating interest rate is applied (from 0% to 36% per annum)\n\nThe loan cost is calculated:\nAmount to be returned = Loan Amount + Overpayment Amount, where\nOverpayment Amount = Loan Amount * Loan Period * (Rate in% / 100)\nAll applicable fees (including a processing fee of PHP 250) are already included in total cost of loan.\n\nExample: You apply for PHP 20,000 and choose repayment over 6 months, your monthly payments will be only PHP 5,000 per month, your total cost of the loan will be PHP 30,000*. All applicable fees (including a processing fee of PHP 250) are already included in total cost of loan.\n\nNote: Loan applications are subject for approval.\n\nEasy and comfortable repayment!\nYou can choose choose the most convenient method to repay your online loan from list below:\n-  7-Eleven\n-  Cebuana or Bayad center\n-  Over-the-counter of Union bank\n-  Online banking of Union bank\n-  Online banking of other banks\n\nCash loan online via loan app in just 4 minutes!\nEvery day we receive thousands of requests from people, who are in a complicated financial situation. About 80% of borrowers recommend serving people they know and are still with us. Online loans can be used for any purpose – be it bike loan, student loan or even loan for mobile phone!\n\nLoan money online now! Online cash lending without leaving home with DigiDo – your new online loan app Philippines helper!\n\nThe additional benefits of mobile loan app:\n• choose independently the sum and term of the loan – all for your comfort!\n• obtain the loan online during the day and night, on the holidays and on the weekends - the transfer can be made at any time.\n• The remuneration is only for the days of the use of the money.\n\nAddress: 16th Floor, IBP Tower, Jade Drive, San Antonio, Pasig City 1600, Philippines\n\n\n        more\n      \n",
        "rating": "3.5"
    }
}