{
    "rank": "61",
    "title": "CashG",
    "company": "    Cash8 Lending Corporation",
    "url": "https://apps.apple.com/ph/app/cashg/id1590307333",
    "detail": {
        "description": "\n\nWe provide easy, transparent, and secured lending services for Filipinos\n\nReady ka na ba magloan? Tara na sa CashG!\n\nG ka na ba magloan? Tara na sa CashG\n\nRequirements:\nAny functioning smartphone\nCashG App\nOne (1) Valid ID\n\nHow do I Apply?\nDownload the CashG App (Available in App Store)\nGo through the registration process\nVerify the details you’ve provided\nWait for approval\n\nWhat do I need to register?\nJust upload one (1) valid Government-Issued ID!\n\nWhat are the privacy and permission policies of CashG?\n\nYour privacy is our topmost priority! The submitted photo of your government-issued ID and other personal information will be used to verify your credit profile on our system. We will NOT share any of your information without your direct consent or explicit permission for any purpose.\n\nOn the app, we will require the following permissions to verify your identity:\nLocation Access - To auto-verify your address.\nContacts Access - To easily nominate your contact references.\nCamera Access - To scan your ID for complete ID verification\n\nHow safe are my personal details?\nAll personal details are fully secured and protected\nData Privacy Agreements are insisted upon registering\nRoutine assessments are done to ensure quality data protection\n\nHow fast is the approval and where can I receive the loan?\nApproval of loan application can take up to 5 minutes to 24 hours\nUpon approval, expect same-day disbursement through Skypay\nCash-out centers: RD Pawnshop and M Lhuillier\nOther withdrawal channels: Bank Transfer, GCash, GrabPay, Paymaya, and Coins.ph\n\nHow do I repay my loan?\nPayment can be partial or in full, as long as it is within the loan period\nYou may check your loan term duration on the app\nPay through our selected payment channels ONLY: RD Pawnshop, M Lhuillier, 7-Eleven, True Money, EC Pay, GCash, Paymaya, and ShopeePay\n\nWhat loan term packages do you offer?\nWe offer a variety of packages depending on your VIP Level\nLoan Amount: Php 2,000 - Php 20,000\nLoan Duration: 60 - 120 days\nMaximum APR: 20%\nTransaction fee: Php 0 - Php 150\nOther fees: Service fee from 10-20%\n\n\nPRODUCT INFORMATION\n-Amount:₱3,000-₱30,000\n-Term: 90days-360 days\n-Service fee: 3%-5%\n-Transfer Fee: ₱0-₱200\n-APR: 18%\n\n\nExample:\nLoan Amount: ₱ 20,000\nLoan Term:180-days\nwith Interest rate: 18%\nTransfer fee:  ₱ 0\nService fee is ₱ 600\nTotal service fee and interest will be ₱ 2,400 pesos.\nTotal received amount is ₱19,400\nNo monthly payment\nTotal repayment for 180 days is ₱ 21,800 (20,000*18%/360*180+20,000) only pay  on the due date.\n\n\n*Reminder: Always check the fees, charges, 'Privacy Policy 'and the ‘Terms and Conditions’ of your loan offer before accepting your loan.\n\n\n\n\n\nWhy choose CashG?\n\nCashG offers all the basic features available in any other app:\nSimple, Easy and Fast process\nAccessible and Readily Available\nMultiple layers of account security\nAccommodating Customer Service\nEvents and Promos\n\nWhat sets CashG apart from any other loaning app is that our upward movement is faster than any other app. Using our app allows you to increase your VIP level with just a few loan applications, giving you:\nIncreased Loan Amounts\nIncreased Loan Durations\nLower Processing Fees\n\nWhat are you waiting for? G na!  Download the APP now and be part of CashG!\n\n\nCashG is a new online lending application aimed to give Filipinos a secure, fast, and reliable online loan experience.\nG ka na ba magloan? Tara na sa CashG\n\nContact Us\nFor questions, feedbacks, or concerns, please contact us at:\nWebsite: www.cashg.ph\nFacebook: https://www.facebook.com/cashgph\nEmail: info@cashg.ph\n\nPlease visit us on our Facebook Page for the latest updates to the CashG FAQs\n\nAll loans under the CashG App are financed by Cash8 Lending Corporation\nSEC Registration: CS201916310\nTax Identification: 010415810\nCertificate of Authority: 3105\n\n\n\n\n        more\n      \n",
        "rating": "3.7"
    }
}