{
    "rank": "46",
    "title": "China Bank Mobile App",
    "company": "    China Banking Corporation",
    "url": "https://apps.apple.com/ph/app/china-bank-mobile-app/id1309420253",
    "detail": {
        "description": "\n\nChina Bank Mobile App is a FREE app that lets you access your China Bank account 24/7 using your smart phone.\nManage your finances and do more with China Bank Mobile at your fingertips –\n• Balance inquiry\n• Pay your bills\n• Transfer funds\n• Access to Emergency Cash. Soon, you can withdraw in any BancNet ATM without a China Bank ATM card.\n• Send money to anyone (Coming soon.)\n\nChina Banking Corporation (Philippines), more popularly known as China Bank, initially catered to the needs of the Filipino-Chinese community. Established in 1920, the Bank was a vital key player in the reconstruction and economic recovery of the country after World War II. In 1927, China Bank was listed in the local stock exchange and in 1969 became the first local bank to process deposit accounts online. In 1991, the bank procured its universal banking license.\nToday, China Bank is one of largest private universal banks in the Philippines. It offers a wide range of financial products and services through its vast network of branches and ATMs both in-bank and off-site. China Bank maintains its focus on building a customer-centric organization and building on the foundations for sustainability, as well as laying the groundwork to be able to compete in the digital banking sphere. It has continued to expand its branch network, strengthen its manpower with highly skilled professionals, enhance its technological platforms, and enter into new business lines.\nIt also provides merger and acquisition, capital raising, debt and securities underwriting, financial restructuring, and economic advisory services by way of its investment banking arm, China Bank Capital Corporation, and securities brokerage through China Bank Securities. It also provides insurance brokerage services and bancassurance through its subsidiaries China Bank Insurance Brokers Inc. and Manulife China Bank Life Assurance Corporation, respectively. The Bank has more than 500 branches nationwide, including more than 150 from its thrift banking subsidiary, China Bank Savings.\nChina Bank is also one of the first banks to distribute EMV-ready ATM cards in compliance with the Bangko Sentral ng Pilipinas, and has also recently upgraded its online personal banking portal to better serve its ever-evolving set of clientele.\n\n\n        more\n      \n",
        "rating": "2.3"
    }
}