{
    "rank": "16",
    "title": "Metrobank Mobile Banking",
    "company": "    Metropolitan Bank & Trust Company",
    "url": "https://apps.apple.com/ph/app/metrobank-mobile-banking/id1138690544",
    "detail": {
        "description": "\n\nMETROBANK MOBILE BANKING\n\nThe Metrobank Mobile Banking app gives you what you want in a banking app, plus more!\n\nDesigned around how you want to do your banking on-the-go, Metrobank gives you a mobile banking app with an easy-to-navigate and customizable interface, banking services such as balance inquiry, bills payment, and funds transfer capabilities, as well as useful services such as buying and sending load, branch locator and rate checking all on your mobile phone!\n\nWHY USE METROBANK MOBILE BANKING\n\n-\tFull online enrollment: use your Metrobank debit card or credit card to activate your account (no need to go to a branch or ATM)\n-\tEasy payments: pay bills, buy/send load, request for payment, send out payment, and more!\n-\tAccount customization: upload profile pics for yourself and your friends, assign nicknames to your accounts\n-\tSend or receive funds using mobile numbers: no need to disclose account numbers when transferring to anyone who is enrolled in Metrobank Mobile Banking. Request for or send out funds with personalized messages as well!\n-\tWhat’s New: read about the latest in financial markets, banking news, and the latest promo deals and offers\n-\tForex Update: get updated foreign exchange rates\n-\tCar and Home Loan Calculator: compute for the monthly installment required for the car or home that you want or request for assistance from a loan specialist\n-\tBranch Locator: know where our branches are via Google Maps\n\nSecurity features for your ease and peace of mind:\n-\tLog-in with a User ID and password.*\n-\tReceive a one-time password (OTP) and notification messages for certain transactions\n-\tUse the Touch ID feature on enabled-devices for quick authorization of selected transactions.\n-\tGet device authorization for every device you use\n\nSTANDARD FEATURES\n\nContinue to enjoy basic functionalities such as:\n-\tView account balance and details\n-\tPay bills/transfer funds one time or make scheduled payments/transfers\n-\tBuy mobile/prepaid load\n-\tReorder checkbook\n\nLearn more about the Metrobank Mobile Banking app at www.metrobank.com.ph/metrobankmobile\n\nThe use of the Metrobank Mobile Banking app is subject to an end-user license agreement which you can find at www.metrobank.com.ph  Personal Banking  e-Channels  Metrobank Mobile Banking\n\nThe Metrobank Mobile Banking app is a property of Metropolitan Bank & Trust Company.\n\n\n        more\n      \n",
        "rating": "3.5"
    }
}