{
    "rank": "42",
    "title": "Money Manager Expense & Budget",
    "company": "    Realbyte Inc.",
    "url": "https://apps.apple.com/ph/app/money-manager-expense-budget/id560481810",
    "detail": {
        "description": "\n\n“Money Manager Next” is an optimized application for personal account management.\n\nHousehold account management is complicated. But we make it simple by simplifying the things that are complex. The default settings will get you started, and once you get used to it, you can alter the settings according to your needs with the highly flexible and customizable functions available.\n\n- Super easy and simple to enter data anytime, anywhere.\n- View your spending tendencies graphically.\n- View statistics by simply entering the data.\n- Search and calculator functions.\n- Set up sub-categories and main categories as necessary.\n- Manage all your accounts at once.\n- Use multiple currencies.\n- Check weekly, monthly, and annual statistics.\n- Use calendar view.\n- Use budget planning features to plan weekly, monthly, and annual budgets.\n- Change the start date of the month.\n\n※ Applying double entry bookkeeping\nIt facilitates efficient account management. Automally double entry bookkeeping.\n\n※ PC manager function\nYou can view ‘“Money Manager” application using Wi-Fi. You can edit and sort the data by date, category or account group on the screen of your PC. In addition, you can see fluctuations of your accounts indicated on graphs on your PC.\n\n※ Budget management function\nYou can manage your budget. It shows your budget and expenditures on a graph so you can compare the amount of your expenditures against your budget quickly.\n\n※ Credit Card / Debit Card management function\nWhen entering a future payment date, you can see the payment amount and outstanding balance on the accounts page. You can connect your debit card to your accounts so that expenses are automatically recorded under a specific account.\n\n※ Passcode\nYou can speficy a desired time lapse before the app requests a passcode.\n\n※ Automatic money transfer and frequency functions\nYou can set up automatic money transfers between your accounts and configure the frequency of those transfers.\n\n※ Sort expenses by recipient\nYou can sort your expenses by recipient and view this information graphically.\n\n※ Payment Profiles\nYou can easily enter frequent expenditures by creating payment profiles.\n\n※ Backup / Restore\nYou can backup and restore your data via email, iTunes and iCloud.\n\n※ Multiple currency support – you can have individual entries in multiple currencies, and configure each account to calculate the total balance in your desired currency.\n\nIn Full Version. (https://itunes.apple.com/app/id564730202?mt=8)\nManage from PC is available.\nThere is no Ads.\nThere is no limit the accounts.\n(In lite version, 10 accounts is available.)\n\n\n\nSubscription pricing and terms:\n\nMoney Manager offers auto-renewing monthly subscription at US$2.49/month and an auto-renewing yearly subscription at US$19.99/year to provide you with unlimited access to the Money Manager Data Sync Service while you maintain an active subscription.\n\nPayment will be charged to the credit card connected to your iTunes Account when you confirm the initial subscription purchase.\nSubscriptions automatically renew unless auto-renew is turned off at least 24-hours before the end of the current subscription period. Your account will be charged for renewal within 24-hours prior to the end of the current period, and the cost of the renewal will be identified.\nYou may manage your subscription and auto-renewal may be turned off by going to your Account Settings after the purchase.\n\nRead more about our terms and conditions here:\nhttps://realbyteapps.com/policy/terms.html\n\nPrivacy Policy:\nhttps://realbyteapps.com/policy/privacy.html\n\n\n        more\n      \n",
        "rating": "4.9"
    }
}