{
    "rank": "5",
    "title": "UnionBank Online",
    "company": "    UnionBank of the Philippines",
    "url": "https://apps.apple.com/ph/app/unionbank-online/id1242291412",
    "detail": {
        "description": "\n\nThis is more than just another banking app. This puts your bank in the palm of your hand. You don’t have to put your life on hold, when you can bank securely whenever you want to, from wherever you want. Get started by opening an account in-app, without ever having to step into a branch. Easily manage your accounts, your cards, transfer funds, pay your bills and more, with just the tap of your finger.\n\nOpen an account\n+ First Philippine bank that enables customers to open accounts through the app.\n+ No need to visit the branch.\n+ Choose between Personal Savings Account, PlayEveryday, Savings+, Lazada or GetGo.\n+ Get a Visa debit card delivered to your home/office.\n+ Immediately get a Lazada Virtual Debit card for online shopping.\n\nDeposit checks 24x7\n+ UnionBank checks clears after two hours – even during weekends and holidays.\n+ Other bank's checks, follows industry cut-off and clearing hours.\n\nSecurely manage your accounts\n+ View all your accounts and credit card balances in one place.\n+ Real-time monitoring of your savings, checking or debit/ATM card activities.\n+ View your credit card spend, points and statements.\n+ Lock/unlock, set limits and transactions controls on your Visa credit cards.\n+ Keep tabs on your loan repayments.\n+ Secured access enabled by OTP and biometrics.\n+ Self-service password reset and profile unblocking.\n+ Track your rank, view your points and access the leaderboards with PlayEveryday.\n+ Create Goals and start saving up for that investment, emergency fund, or whichever you aspire to achieve.\n\nEasily Transfer Funds and Pay Bills\n+ Transfer funds to anyone, to any bank, any time, without any enrolment or going to the branch.\n+ Real-time crediting for transfers between your accounts or other UnionBank accounts.\n+ Transfer to anyone for free with PESONet. Same or next business day crediting.\n+ Transfer up to Php 50,000.00 to anyone with InstaPay. Real-time crediting for only PHP10.\n+ Transfer your US Dollars to other local banks for only USD1! Made possible through PDDTS.\n+ Pay your utility, phone, rent, school, and more. No need to enroll billers for payment.\n+ Save accounts you frequently transfer to and bills you regularly pay.\n+ Schedule recurring transfers and bills payments. No need to worry about due dates.\n+ Send money to our partner Remittance Centers – Palawan Express, Cebuana Lhuillier, LBC & PeraHub.\n\nRequest for Payments or Split Bills\n+ Send payment requests to another UnionBank Online user with just their mobile number. No more sharing of account numbers.\n+ Split bills with your friends on UnionBank Online. No more worksheets to compute who owes who and how much.\n+ Generate your own QR code and have your friends scan the QR to pay.\n\nSchedule branch visit\n+ Get ahead of the queue by scheduling your branch visit in the app.\n+ Transact without any forms or signatures. Put all your transaction info on your scheduled visit.\n+ Find the closest branch or ATM with the built-in locator.\n\nOther Features\n+ Activate your new credit card.\n+ Redeem your Credit Card points.\n+ Check for promos and discounts in our Voucher Wallet\n+ Do USD/PHP conversion and view real-time FX rates.\n\nCheck our web version: https://online.unionbankph.com\n\n2018 Best Retail Mobile Banking Experience by The Asset Magazine\n2018 Online Banking Initiative of the Year by Asian Banking and Finance\n2018 Best Technology Implementation - Front End by Retail Banker International (Highly Commended).\n\nUnionBank of the Philippines is regulated by the Bangko Sentral ng Pilipinas. For inquiries and comments, contact our Customer Service at customer.service@unionbankph.com or (+632) 841-8600. Member: PDIC. Maximum deposit insurance for each depositor: P500,000.\n\n\n        more\n      \n",
        "rating": "3.4"
    }
}