{
    "rank": "25",
    "title": "RCBC Digital",
    "company": "    Rizal Commercial Banking Corporation",
    "url": "https://apps.apple.com/ph/app/rcbc-digital/id511838133",
    "detail": {
        "description": "\n\nNo more putting off your financial goals, and yes to an easy, secure, and complete way to do digital banking now!\n\nDownload RCBC Digital and open an account online today. With just 1 valid ID, you can open an account all online in minutes! Plus, upgrade your account with any of the following add-ons upon opening your account, no additional documents needed!\n\n• MyDebit ATM card\n• MyWallet Virtual Prepaid card\n• Checkbook\n• RCBC Bankard credit card\n\nExperience easy, complete, and secure online banking solutions:\n• Fund Transfers\nSend money to anyone, anytime, anywhere – even if they don’t have a bank account. You can transfer funds in real-time to any local banks and e-wallets via Instapay, or send large amounts via PesoNet. Plus, send foreign currencies locally & internationally through our Telegraphic Transfer features.\n• Bills Payment\nUtility bills? Credit card or loan payments? Tuition fees? Government fees? We got you covered! Pay over 400 billers directly – no need to enroll them!\n• Online Check Deposit\nSafely deposit checks from any local bank with just a photo!\n• Online Investments\nConveniently manage your investments online. With RCBC Digital,, you can place, monitor and redeem UITFs and time deposits without going to the branch!\n• Foreign exchange online\nConvert your money to US Dollar, Japanese Yen and other foreign currencies for travel and investment, all online!\n• Cardless Withdrawal\nNeed cash but you forgot your ATM card at home? We got you covered! You can withdraw up to P5,000 in any RCBC ATM, even without your ATM card!\n• Digital Concierge\nRequest bank certificates, ATM replacements and checkbook reorders in advance, all online! Just pick it up at the branch when it’s ready!\n• Monitor ALL your accounts in just ONE app!\nWith RCBC Digital,, you can monitor transactions in your deposit accounts, loans, credit cards and investments all in one app!\n• Keep your online account safe & secure\nWith RCBC Digital, we have security features to ensure only you have control and access to your account and prevent unauthorized transactions. You can lock and unlock your MyDebit ATM and MyWallet Prepaid cards when not in use. All transactions are also verified with a one-time PIN (OTP) sent to your registered mobile number, so you can approve your transactions before pushing through.\n• Update your contact information online\nWhether you want to enroll or you are already enrolled in RCBC Digital, you can update your mobile number and/or email address without going to the branch! Keeping your contact information updated is important in keeping your account safe and secure.\n• And more!\n\nDo your banking with RCBC now\n\n\n        more\n      \n",
        "rating": "3.7"
    }
}