{
    "rank": "38",
    "title": "PesoOnline",
    "company": "    MYCASH LENDING INVESTORS INC.",
    "url": "https://apps.apple.com/ph/app/pesoonline/id1615372217",
    "detail": {
        "description": "\n\nPeso Online provides safe online loan service to ordinary Filipino borrowers with their financial problems.\n\nProduct Introduction: Based on the mobile Internet full-process online loan APP, mainly to solve the small amount credit loan needs of individuals and small business owners in the Philippines, providing small amount loan.\n\nYour loan will be disbursed to your preferred cash-out option once the verification is done.\nFor Bank and E-Wallet cash-out, you may receive your money while you are paying.\n\n■ Why choose us?\n1. Steps of operation: download the APP, select the loan amount online and submit the information online.\n2. Fee transparency: there is no hidden penalty, all fees will be stated after use, and no other fees will be charged.\n3. Good service: if you have any questions, please contact us through the online service provided by the app or dial our customer service number.\n4. Security: protect all user data, and the information you submit will not be disclosed.\n5. Flexibility: it can be renewed; You can re-loan after repayment.\n\n■ How much can you borrow?\nThe higher your credit, the more money you get !\n\n■ Conditions for using Opeso?\nThe age over 18 years old.\nShop Now and Pay Later minimum repayment period is 91 days and maximum is 120 days.\nThe loan amount we offer is at Php2,000-Php20,000. As for the actual loan amount, it can be adjust depending on you own need.\nFlexible loan term option with interest staring from 1%.\nLoan interest :up to 36%/year (APR)\nTransaction Fee: Zero\n\nFor example:\nIf you choose a loan limit of Php20,000 with loan term of 120 days.\nLoan Amount: Php20,000\nTransaction Fee: Zero\nLoan Term: 120 days\nTotal Payment: Php22,367 (Php20,000*36%*120/365+Php20,000=Php22,367)\nPercentages above are inclusive of applicable taxes.\n\n■ How do I use PesoOnline?\n1. Download and install PesoOnline and complete registration.\n2. Select loan amount and repayment time.\n3. Fill in the certification information online to submit the application.\n\nHope you can enjoy our loan products, and hope you can share with your friends and family, let me accompany you to spend a wonderful life!\n\nSEC Company Name: MyCash LENDING Investors INC.\nSEC Company Registration no: CS201840987\nEmail： officiallypeso.online@gmail.com\nTel: Globe: 09668164688\nTNT: 09636005379\nAddress: 12/F ASEANA 3 BLDG. MACAPAGAL AVE. COR ASEANA AVE. ASEAVA CITY, TAMBO, PARANAQUE CITY\n\n\n        more\n      \n",
        "rating": "4.7"
    }
}