{
    "rank": "64",
    "title": "lendpinoy",
    "company": "    AND Financing Corporation",
    "url": "https://apps.apple.com/ph/app/lendpinoy/id1454784792",
    "detail": {
        "description": "\n\nWe are here to support your life to become more cheerful!\n\nLoan up to P60,000 with terms 90 or 180 days!\n\nlendpinoy is the loan app product of AND Financing Corporation (AND FC). AND FC is a duly registered financing company with SEC Registration No. CS201840930 & Certificate of Authority to Operate (as a Financing Company) No. 1187.\n\nAND FC strictly adheres with the local regulations & standards, including the Truth in Lending Act of the Philippines (RA3765). We are an official submitting entity of the Credit Information Corporation (CIC), in compliance with RA9510. Moreover, we are compliant with the Anti-Money Laundering Commission & National Data Privacy Commission.\n\nLoan Application Requirements:\nValid government ID\nValid phone number\nVoice verification\nLatest pay-slip copies\nCertificate of Employment\n\nYou may apply if you are:\nWorking in Metro Manila\nLiving in Metro Manila, Cavite, Laguna, Rizal, or Bulacan\nCurrently regularly employed for 6 months or more\nHas a salary of at least P15,000 per month\nHas an SSS number\n21 years old and above\n\nPrivacy & Consent\nThe protection of your personal information is our utmost priority, we strictly adhere with the Data Privacy Act of 2012 (RA10173) & its Implementing Rules & Regulations.Always read & review the Privacy Policy, Terms & Conditions & Loan Agreements (to include Disclosure Statement) prior to proceed with the application & loan disbursement.\n\nHow to apply?\nDownload the lendpinoy app\nFill out our fast loan application in the app\nUndergo verification through our secured AI, Machine Learning system\nOnce approved, your cash is directly sent to your nominated bank account in minutes.\n\nHow to repay?\nPlease visit https://lendpinoy.ph/faq/#repayment for the latest information.\n\nlendpinoy loan:\nlendpinoy offers loans up to P60,000 with 3 and 6 month installments.\n\nRepresentative Example:\nLoan amount: P6,000\nTerm: 3 months\nMonthly interest rate: 6.00% (APR 72%)\nEffective monthly interest rate: 5.99%\nOther fees: None (no processing fee, no service fee)\nSample monthly repayment: (Principal + Interest)\n1st month: P 1,884 + P 360 = P 2,244\n2nd month: P 1,998 + P 246 = P 2,244\n3rd month: P 2,118 + P 127 = P 2,245\nTotal principal payment PHP 6,000 and total interest cost PHP 733.\n\nOur Commitment\nAt lendpinoy, we value responsible borrowing & we strongly advocate financial literacy. For every loan, you will be provided a Disclosure Statement that you will either agree to or discontinue the loaning process. We encourage our customers to always review the fees, charges & terms & conditions of your loan offer before proceeding & accepting your loan.\n\nFor any inquiries or comments, immediately message us at contact@lendpinoy.ph & we shall gladly assist you.\n\nIf you have any feedback, questions, or concerns, please contact us at:\nWebsite: https://lendpinoy.ph/\nEmail: contact@lendpinoy.ph\nCS Hotline: 09178775363 (Globe), 09088905389 (Smart)\nFacebook: @lendpinoy\n\n\n        more\n      \n",
        "rating": "3.7"
    }
}