{
    "rank": "69",
    "title": "Remitly: Money Transfer & Send",
    "company": "    Remitly Inc",
    "url": "https://apps.apple.com/ph/app/remitly-money-transfer-send/id674258465",
    "detail": {
        "description": "\n\nRemitly is trusted by millions for sending money to family and friends overseas. Transfer money safely to 100+ countries worldwide! Remitly is secure and fast, with great rates for currency exchange. No fees for recipients, low fees for sending.\n\nFeel safe in sending money to India, Pakistan, Philippines, Ghana, Bangladesh, Nigeria, China, Brazil, Kenya, Colombia, Nepal, Morocco, Vietnam, Poland, and more. You’ll get the exact date and time your money will arrive with your family.\n\nRemitly helps you transfer funds worldwide using your bank account, credit card, or debit card. More money makes it home to friends and family thanks to Remitly’s great rates, special offers, and no hidden fees. Remitly provides multiple levels of security for all transfers to protect your money against fraud.  Senders and recipients can talk to a real person on our Customer Care Team any hour, any day.\n\nGet a special offer on your first transaction! Send money to 3,000+ banks and 350,000+ cash pickup locations worldwide. Home delivery options available in the Philippines, Dominican Republic and Vietnam. Send cash to 50+ mobile money providers including M-Pesa, MTN, Vodafone, eSewa, GCash, Paymaya, bKash, EasyPaisa, and GoPay.\n\nSend money to India:\n• Send money to 130+ trusted banks including ICICI, HDFC, SBI, YesBank, Kotak Bank, and more with direct bank transfer\n• Send to 20+ banks using UPI\n• Recipients can pick up their money at 100,000+ locations including Punjab National Bank, EbixCash, Weizmann Forex, Muthoot Fincorp, and more\n\nTransfer funds to Pakistan:\n• Send to 35+ trusted banks including MCB, Bank Alfalah, Habib Bank, United Bank, and more\n• Recipients can pick up their money at 9,500+ cash pickup locations, including MCB\n\nSend cash to the Philippines:\n• Send to 45+ trusted banks including BDO, BPI, PNB, Metrobank, and more\n• Recipients can pick up their money at 17,000+ cash pickup locations\n• Choose from mobile money options including GCash, Paymaya, and Coins.ph\n\nSend money to Ghana:\n• Choose from mobile money options like MTN Mobile Money, AirtelTigo, Zeepay and Vodafone Cash\n• Send to 35+ trusted banks like GCB Bank, Ecobank, Fidelity Bank, and more\n• Recipients can pick up their money at 1,600+ cash pickup locations\n\nSend money to South Asia:\n• Send cash to your loved ones in Bangladesh, Nepal, and Sri Lanka\n• Send to 100+ trusted banks including bKash, Islami Bank Bangladesh, BRAC Bank, Bank of Ceylon, Sampath Bank, eSewa, NIC Asia Bank, and more\n• 2% Cashback Incentive for your recipient on transfers. Learn more at https://help.remitly.com/s/article/bangladesh-cash-incentive\n• Recipients can pick up their money at 12,000+ cash pickup locations\n• Choose from mobile money options including bKash\n\nSend money to Africa:\n• Transfer money to 30+ countries in Africa including Nigeria, Ghana, Kenya, Uganda, Tanzania, South Africa, Zimbabwe, Liberia, Ethiopia, Rwanda and more\n• Send money to your recipients’ MTN, AirtelTigo, M-Pesa, Vodafone, Tigo, or Zeepay mobile money account in Ghana, or to trusted banks including GCB Bank, Ecobank & Fidelity Bank for bank deposit or cash pickup\n• Send cash to mobile money accounts in Kenya including M-Pesa, Airtel & Equitel or send for bank deposit or cash pick up at trusted banks like Equity Bank, KCB & Co-operative Bank and more\n• Send US Dollars to Nigeria and recipients receive a bonus of 5 Naira for every 1 USD received. Send money for USD cash pickup and bank deposit at GT Bank, Polaris Bank and more\n\nRemit funds to China:\n• Send money to Alipay users in China and send funds via WeChat\n\nWire money to Brazil:\n• Send money to 45+ trusted banks like Caixa Econômica Federal, Banco do Brasil, Itaú Unibanco, and more, or bank deposits 24/7 with PIX key\n• Recipients can pick up their money at 500+ cash pickup locations\n\nSend money to Colombia:\n• Send money to 20+ trusted banks like Bancolombia, Éxito, Banco Davivienda, and more\n• Recipients can pick up their money at 3,000+ cash pickup locations\n\n\n        more\n      \n",
        "rating": "4.8"
    }
}