{
    "rank": "96",
    "title": "Monefy: Money Tracker",
    "company": "    Reflectly ApS",
    "url": "https://apps.apple.com/ph/app/monefy-money-tracker/id1212024409",
    "detail": {
        "description": "\n\nHow to track your expenses successfully? We know that it’s easy. You only need to add each expense you do… no more than that! And Monefy is going to help you. Just add new transactions when you are buying a coffee or taking a taxi. It’s done in one click, because you do not need to fill anything except the expense amount. It has never been so quick and enjoyable!\n\nDo you own a phone and a tablet? Or you want to track expenses together with your significant other? Monefy fits the best. You can safely synchronize data between devices using your own Google Drive or Dropbox account. Create or change records, add new categories or delete old ones and they will be present on another devices right away!\n\nKey features which make tracking enjoyable and powerful:\n1. Intuitive and easy to use user interface. No redundancy\n2. Add new records extremely fast\n3. See your spending distribution on the nice and informative chart or get detailed information from the records list\n4. Multi-currency support\n5. Manage categories if defaults do not work for you\n6. Be safely synchronized using your own Google Drive or Dropbox account\n7. Choose the report period\n8. Track recurring records easily\n9. Passcode protection\n10. Multiple accounts support\n11. Built-in calculator\n12. No ads\n\nMONEFY PREMIUM:\n\nThe app offers an auto-renewing Premium Subscription. Payment will be charged to iTunes Account at confirmation of purchase. Subscription automatically renews unless auto-renew is turned off at least 24-hours before the end of the current period. Account will be charged for renewal within 24-hours prior to the end of the current period, and identify the cost of the renewal. Subscriptions may be managed by the user and auto-renewal may be turned off by going to the user's Account Settings after purchase. Any unused portion of a free trial period, if offered, will be forfeited when the user purchases a subscription to that publication, where applicable.\n\nAny prices referenced are in US Dollars (USD). Pricing in other currencies and countries may vary and actual charges may be converted to your local currency depending on the country of residence.\n\nPrivacy Policy: https://monefy.me/monefy-privacy-policy/\nTerms of Service: https://monefy.me/terms-of-service\n\nFind more information on our website - https://www.monefy.me\n\n\n        more\n      \n",
        "rating": "4.8"
    }
}