{
    "rank": "90",
    "title": "RapidCash",
    "company": "    FLYING BEAR LENDING GORP",
    "url": "https://apps.apple.com/ph/app/rapidcash/id1592061851",
    "detail": {
        "description": "\n\nLoan Products\nRapid Cash Online Credit Loan Products\nLoan period: 3, 6, 12 months installments (91-365 days)\nLoan limit: ₱ 3000 - ₱ 30,000\nInterest rate (maximum APR): 24% per annum\nService fee：0%\n\nAn example for a loan of ₱ 3000 with a term of 120 days, the fees charged are as follows:\nMonthly interest rate：24%/12 = 2%\nMonthly interest：₱3000*2%=₱60\nTotal monthly payment = ₱3000*2% + ₱3000 = ₱3060\nTotal interest: ₱3000 * (24%/360) * 120 days = ₱240\nTotal return fee: ₱3000 + ₱240 = ₱3240\n\nRapid Cash - Application for borrowing cash online, easy liquid cash without collateral, unsecured credit, get rupiah cash loans online, safe and trustworthy. As an online cash loan provider platform, Rapid Cash is a Smart Solution for your Financial Needs.\n\nWho can borrow?\nFilipino citizen\n20 years and over\nHave ID card and bank account\n\nHow to apply for an online loan at Rapid Cash?\n1.Download Rapid Cash on APP Store.\n2. Login only with your mobile number.\n3. Select the online loan amount and payment period you want.\n4. Upload all the requested information correctly.\n5. Easy loan application approval.\n6. Aged 20 years and over.\n\nThe entire loan process can be completed via a smartphone anywhere at any time. Don't worry, we have Rapid Cash! Easy online cash loans without collateral and without credit cards.\n\nPayment Method:\nSMS sent before & when due for a reminder to pay off the loan.\nPayments: E-wallet, Bank transfer, RD Pawnshop\\ M Lhuillier.\n\nWhy borrow credit online at Rapid Cash?\nNO WARRANTY\nNo need for a credit card and no admin fees or other funds, apply for a cash and liquid loan to your account. High disbursement rate! Enjoy smart online credit loans without collateral without any property collateral!\n\nINSTALLMENT LOAN\nEasy online loans, long online loan tenures & can be paid in installments or in monthly installments, helping your business finances run smoothly. Only Rapid Cash has a low interest monthly installment loan. Borrow money online now, pay next month!\n\nSAFE AND RELIABLE\nRapid Cash protects all customer data & info. Borrow cash easy online safely without collateral.\n\nEASY AND FAST\nOnly by downloading the Rapid Cash application, quick reviews, easy cash loans, all processes are carried out via cellphone. Direct loans disbursed up front, free to use for your needs.\n\nFor more information, contact us at:\nEmail：help@rapidpeso.com\nCustomer Service Hours：Monday - Friday 09:00 - 18:00, Saturday 08:00-17:00\nAddress : 8th Floor Rockwell Business Center Tower 3, 100 Ortigas Avenue Pasig 1604 Metro Manila Pasig NRC Philippines\n\n\n        more\n      \n",
        "rating": "2.1"
    }
}