{
    "rank": "26",
    "title": "BDO Pay",
    "company": "    BDO Unibank, Inc.",
    "url": "https://apps.apple.com/ph/app/bdo-pay/id1381315990",
    "detail": {
        "description": "\n\nBDO's digital payment app that makes everyday payments as easy as 1-2 tap!\n\nScan to Pay in Stores, Send and Request Money, Pay Bills and more, all conveniently through your mobile phone.\n\n\nSEND MONEY TO OTHER BANKS AND MOBILE WALLETS\nSend Money to other banks and mobile wallets in just a few taps via InstaPay! Just enter your receiver’s details, and Send Money\nstraight from your linked BDO accounts.\n\n\nSEND MONEY FOR FREE TO BDO ACCOUNTS\nIf they're on BDO Pay, just use their number or look for their name in your phone's contacts. Or copy-paste an account number and\ntap Send!\n\n\nPAY BILLS WITHOUT ENROLLING BILLERS\nPay your bills safely from the comfort of your home. No need to enroll billers - just enter your bill details and hit Pay! Enjoy new\nbillers added every week.\n\n\nGO CASHLESS ONLINE OR IN-STORE\nWhether you’re paying online or in-store, make it safe and convenient with BDO Pay’s cashless QR payments. Enjoy BDO Pay’s\ngrowing network of in-store QR merchants.\n\n\nSPLIT BILLS AND REQUEST YOUR FRIENDS’ SHARE IN ONE TAP\nMake it easy to split group payments with BDO Pay! Divide the bill evenly with up to five other people or request different\namounts per person, and get paid straight to your account. No need to count cash or find change!\n\n\nREQUEST MONEY LIKE A PRO\nAsking someone to pay you back is now digital with the BDO Pay app. When someone receives your request, all they have to do is\ntap Send, and the amount goes straight into your deposit account.\n\n\n__________________________\nBDO Unibank is regulated by the Bangko Sentral ng Pilipinas with telephone no. (02) 8708-7087, email address\nconsumeraffairs@bsp.gov.ph, and webchat at www.bsp.gov.ph.\n\n\nFor concerns, please visit any BDO branch nearest you, or contact us thru our 24x7 hotline (+632) 8631-8000 or email us via\ncallcenter@bdo.com.ph.\n\nThe BDO, BDO Unibank and other BDO-related trademarks are owned by BDO Unibank, Inc. BDO Unibank Inc. © 2012. All Rights\nReserved.\n\n\n        more\n      \n",
        "rating": "2.1"
    }
}