{
    "rank": "67",
    "title": "PCash",
    "company": "    PCash Ph",
    "url": "https://apps.apple.com/ph/app/pcash/id1614611720",
    "detail": {
        "description": "\n\nPartner up with PCash! Rest assured that you are getting the best deals when loaning with us. Our low rates are guaranteed to give you the best Possible PCash experience!\n\nPave your Path with PCash!\n\n\n\n\nRequirements:\nAny functioning smart device\nPCash App\nOne (1) Valid Government-Issued ID\n\n\n\n\nHow do I Apply?\nDownload the PCash App\nComplete the registration process\nWait for the verification of your submitted info\nConfirm the approved loan details\n\n\n\n\nWhat do I need to register?\nJust upload one (1) valid Government-Issued ID!\n\n\n\nWhat are the privacy and permission policies of PCash?\n\nPCash is strictly compliant with the Data Privacy Law as we respect your privacy rights. The submitted documents upon your registration will be used to verify your credit profile on our system. We will NEVER share any of your data without your direct consent or explicit permission for any purpose.\n\n\n\n\nHow safe are my personal details?\nFully secured and protected of all personal details and informations\nData Privacy Agreements are insisted upon registering\nStrictly complies to the guidelines set by the NPC\nRoutine assessments are done to ensure Quality Data Protection\n\n\n\nOn the app, we will require the following permissions to verify your identity:\nCamera Access - To scan your ID for complete ID verification\nLocation Access - To auto-verify your address\nContacts Access - To easily nominate your contact references.\n\n\n\n\nHow fast is the approval and where can I receive the loan?\nApproval of loan application can take as fast as 5 minutes to 24 hours\n\nUpon approval, expect same-day disbursement through Skypay\nCash-out centers: RD Pawnshop, M Lhuillier and Palawan Pawnshop\nOther withdrawal channels: Bank, GCash, ECPay, and Coins.ph\n\n\n\n\nHow do I repay my loan?\nPayment can be partial or in full, as long as it is within the loan period\nYou may check your loan term duration on the PCash app\nPay through our selected payment channels ONLY: RD Pawnshop, M Lhuillier, 7-Eleven, True Money, EC Pay, GCash, Paymaya, and ShopeePay\n\n\n\n\nWhat loan term packages do you offer?\nWe offer a variety of packages depending on your user’s VIP Level\nLoan Amount: Php 2,000 - Php 50,000\nLoan Duration: 61 - 120 days\nMaximum APR: 20%\nTransaction fee: Php 0 - Php 150\nOther fees: Service fee from 10-20%\n\n\n\n\nPRODUCT INFORMATION\n-Amount:₱3,000-₱30,000\n-Term: 90days -360 days\n-Service fee: 3%-5%\n-Transfer Fee: ₱0-₱200\n-APR: 18%\n\n\n\n\nExample:\nLoan Amount: ₱ 20,000\nLoan Term:180 days\nwith Interest rate: 18%\nTransfer fee: ₱ 0\nService fee is ₱ 600\nTotal service fee and interest will be ₱ 2,400 pesos.\nTotal received amount is ₱19,400\n\nNo monthly payment\nTotal repayment for 180 days is ₱ 21,800 (20,000*18%/360*180+20,000) only pay on the due date.\n\n\n\n*Reminder: Always check the fees, charges, 'Privacy Policy 'and the ‘Terms and Conditions’ of the loan offer before accepting any loan.\n\n\n\n\nWhy choose PCash?\nPCash offers all the basic features available in any other app:\nSimple and Easy Registration Process\nAccessible and Available App - Anytime and Anywhere\nMultiple Layers of Account Security\nDedicated Customer Service\nExciting Events and Promos\n\n\n\n\nWhat sets PCash apart from any other loaning app is that PCash respects your right to privacy.\nUsing our app allows you to increase your VIP level with just a few successful loan applications, which gives you:\nHigh Loan Amount\nLonger Loan Duration\nLower Processing Fees\n\n\n\nDownload the PCash app now!\n\n\n\nPCash is an financial platform to aide fellow Filipinos pave their way to a brighter future. Our mobile application ensures affordable, flexible and secure access to financial assistance.\n\n\n\nContact Us\nFor questions, feedbacks, or concerns, please reach us at:\nWebsite: www.pcash.ph\nFacebook: facebook.com/pcashph\nEmail: info@pcash.ph\n\n\n\n\nPlease visit our Facebook Page and official website for the latest updates of PCash FAQs.\n\n\n\nPCash PH is operated by Horizon Plus Lending Corporation, with Company Reg. No. 2021110033909-03 and Certificate of Authority No. L-21-0094-28, located in Pasig City.\n\nKindly read the Terms and Conditions before continuing with your loan application.\n\n\n        more\n      \n",
        "rating": "3.2"
    }
}