{
    "rank": "31",
    "title": "Coins.ph – Buy Bitcoin, Crypto",
    "company": "    Coins Asia",
    "url": "https://apps.apple.com/ph/app/coins-ph-buy-bitcoin-crypto/id972324049",
    "detail": {
        "description": "\n\nCoins.ph is Philippines No. 1 crypto wallet that allows users to buy Bitcoin (BTC), Etherum (ETH), Axie Infinity (AXS) and more. Trusted by millions of Filipinos. You can enjoy easy access to crypto spot trading pairs — from fiat-crypto or crypto-to-crypto. Sign up now, get verified and start your crypto journey with Coins!\n\nHere are some benefits and reasons to download Coins.ph App:\n\nCOMPLIANT AND REGULATED BY BANGKO SENTRAL NG PILIPINAS (BSP)\nCoins.ph is regulated by the Bangko Sentral ng Pilipinas (BSP). We are the first ever cryptocurrency company in Asia to hold both Virtual Currency and Electronic Money Issue licenses from a central bank.\n\nBUY AND SELL CRYPTO\nCoins.ph offers a secure multi-cryptocurrency mobile wallet. You can instantly buy and sell Bitcoin (BTC), Ethereum (ETH), Ripple (XRP), US Dollar Coin (USDC), Axie Infinity Shards (AXS), SLP (Smooth Love Potion), Tether (USDT) and more through Convert.\n\nBE ALERTED WHEN PRICE MOVES ON CERTAIN COINS\n\nYou can set price alerts with a single tap to stay up to date on the latest prices and trends.\n\nCASH IN AND CASH OUT FIAT TO BUY CRYPTO EASILY\nYou can easily add funds to your Coins Wallet via a variety of international and local payment methods. Top up fiat to buy crypto via PESONet network-approved bank transfer, Western Union international transfer, local e-wallets such as GCash, Paymaya, TouchPay and more.\n\nUser can also fund transfer to 70+ major banks (BPI, Landbank, BDO, etc.), select 5,000+ cash pickup locations (Cebuana Lhuillier, GCash, Palawan Express) and select door-to-door delivery for cash out options (via LBC Pesopak cash out).\n\nPAY BILLS, BUY LOAD, RECEIVE REMITTANCES AND MORE\nBuy prepaid loads, send money, pay bills, and receive remittances from 200+ countries - even without a bank account.  Pay for your electricity, government, water, telcom and more. We support 95+ more billers in the Philippines and you can add your favorite bills and set bill reminders.\n\nLoad your BEEP card and check your card balance. Alternatively, users can also load EasyTrip NLEX and Autosweep SLEX Toll accounts. Verified users can also choose from 70+ mobile promotions from all major Philippine providers and buy international loads for prepaid phones in more than 130 countries.\n\nSend and receive remittances through Western Union from 500,000+ locations in 200+ countries or send money to GCash, Paymaya and any major bank or remittance center in the Philippines.\n\nBUY GAME CREDITS WITH FIAT, PLAY CRYPTO GAMES AND CASH OUT CRYPTO EARNINGS\nGaming enthusiast can buy console, mobile & PC games instantly, with or without a debit/credit card. Coins.ph Wallet supports Steam Wallet, Razer Pin, Garena Shells, Level Up! and more.\n\nAre you a GameFi? Play-to-Earn player? You can easily cash out your SLP & AXS earnings with multiple wallet options. Transfer SLP & AXS from a Ronin Wallet Address or from an Ethereum network (ERC-20) wallet address directly to Coins.ph. Download the app to keep a lookout for more GameFi, crypto and non-crypto gaming partnerships.\n\nSEND FIAT MONEY AND CRYPTO\nSending money via peer to peer (P2P) option from Coins.ph wallet is FREE via mobile, email or Facebook. You can also send money to any major bank or remittance center in the Philippines. Surprise your friends and family by sending a fun holiday ang pao (red envelope) via Coins app.\n\nRESPONSIVE CUSTOMER SUPPORT\nWe’re always here to help, whether you’re a longtime user or just getting started. Speak to our customer support in English or Tagalog and we will make sure your queries are dealt professionally and efficiently. Email help@coins.ph.\n\nStay updated on Philippines' crypto happenings here:\n\nLearn more:\nCoins.ph Blog: coins.ph/blog\nCoins.ph Help: support.coins.ph/hc/en-us\nTelegram Announcements: t.me/coinsph_announcements\n\nJoin our communities:\nTwitter: twitter.com/coinsph\nFacebook: facebook.com/coinsph\nInstagram: instagram.com/coinsph\nTelegram: t.me/coinsph_community\n\n\n        more\n      \n",
        "rating": "4.7"
    }
}