{
    "rank": "21",
    "title": "Cashalo - Cash Loan and Credit",
    "company": "    Oriente Express Techsystem Corporation",
    "url": "https://apps.apple.com/ph/app/cashalo-cash-loan-and-credit/id1346512953",
    "detail": {
        "description": "\n\nYour partner for cash loans and installment shopping\n\nCashalo is your financial partner, whether for urgent needs or to shop for the  Iatest gadgets. It is designed for Filipinos, by Filipinos. The app’s name itself is a combination of two words: Cash and Kasalo, which means \"to have a partner for your finances\".\n\n0% Interest Shopping\nNo interest and no processing fees at select Cashalo partner stores nationwide\n\nBuy Now Pay Later Online\nShop up to P12,000 from major online stores and pay in installments\n\nCash-Out with Bank Account, GCash, or PayMaya\nMultiple disbursement options for yoour convenience\n\nBuy Vouchers\nGet up to P12,000 worth of vouchers for groceries, mobile load, and more; pay in installments\n\nFast Approval & Disbursement\nGet your loans and credit approved in as fast as 8 minutes and funding to your bank account in as fast as 30 minutes!\n\nLow Interest Rates\nLoan and credit should be as affordable and transparent as it is fast, easy, and secure to access.\n\nEasy Application Process\nVerify your identity and submit all the requirements in the app with at least one (1) valid ID to complete your Credit Profile.\n\nWe have the right product for your needs\nCash Loan – Get cash of up to Php 7,000!\nBuy Now Pay Later – Shop for gadgets, appliances, vouchers, and more;  pay later in installments! *\nLazada Loan - Top up your Lazada Wallet and shop safely from home\n\nLet’s say you want to buy a mobile phone. You can shop now and pay later in 3, 5, 6, or 8 monthly installments from any participating stores.*\n\nFor example:\n\nTotal price of mobile phone: Php7,000\nDown payment: 20% (Php1,400)\nLoan amount: Php5,600\nProcessing fee: 10% (Php560)\nLoan term: 6 months\nMonthly interest rate: 5.99% (Php 335)\nSample monthly payment: Php 1,222.33\nTotal payment: P7,334\n\n*Shop Now and Pay Later minimum repayment period is 90 days and maximum is 180 days from Cashacart participating stores.\n**Shop Now and Pay Later maximum effective APR% is at 49.68%.\n\n***\nPrivacy and Permissions\nYour privacy is very important to us. We will scan your government-issued ID and other information to verify your identity and Credit Profile. Your personal information will never be shared without your direct and explicit permission.\n\nTo verify your identity, we require the following app permissions:\nStorage (File Access) - We use your device storage as temporary data storage during entry of your user profile and to allow you to upload images in the app\nLocation - We use your location and device information to help us prevent fraud, validate information you provided, and calculate/assess your credit\nExternal Data about Other Apps - We use information about installed applications to help us prevent fraud and calculate/assess your credit\n\n***\nContact Us\nNandito kami para sa'yo, Kasalo! For questions, feedbacks, or concerns, please contact us at:\nWebsite: www.cashalo.com\nFacebook: @CashaloPH\nInstagram: @CashaloPH\nAddress: 16F World Plaza, BGC, Taguig City, Philippines 1634\nEmail: hello@cashalo.com\nContact Number: +63 2 8470 6888\n\nPlease visit https://www.cashalo.com/faq/ for the latest updates to the Cashalo FAQs\n\nAll loans under the Cashalo Platform are financed by Paloo Financing Inc., with SEC Registration No. CSC201800209 and Certificate of Authority No. 1162\n\n***\nAbout Us\nCashalo is a Filipino technology and financial services company, committed to building a more financially inclusive future for or all Filipinos. Through the Cashalo app, our technology enables fast and secure access to credit at the push of a button.\n\nCashalo, is a wholly owned subsidiary of Hong Kong based Oriente (whose founders are behind internet giants Skype and LU.com).\n\n\n        more\n      \n",
        "rating": "4.3"
    }
}