{
    "rank": "88",
    "title": "CashNow-Safe Loan App",
    "company": "    Quantix Technology Projects L.L.C.",
    "url": "https://apps.apple.com/ph/app/cashnow-safe-loan-app/id1584115206",
    "detail": {
        "description": "\n\nIt might only take a few minutes to apply and receive approval. The cash advance application process is quick and simple - upload Emirates ID and follow instructions to complete the procedure. Once the application is approved, money can be instantly transferred to the bank account.\n\nBest Personal Loan for Everyone\nEven if people don’t have a bank account or a credit card, CashNow makes instant loans possible for everyone. Powered by AI technology and cloud computing, CashNow conducts sophisticated credit check and risk management while provides people a simple money lending user journey.\n\nNo Hidden Fees\nInterest Rate: 34.0% per annum.\nProcessing Fees: 4.9%. The fees will be deducted from the credits.\nLoan period：we will require the repayment from 90 days to 180 days.\nHere is an example, if a user takes the principal amount of AED 1500 payable in 3 months, interest is AED 121.5 and the processing fee is AED 73.5. You will receive AED1426.5, while the total amount due is AED 1621.5.\n\nWhatever your needs are, with instant loans it's easy to apply for cash up to AED1,500.\nGet your instant personal loan now. Easy, Fast, and Convenient.\nHere is an example, if a user takes the principal amount of AED 1500 payable in 3 months, interest is AED 121.5 and the processing fee is AED 73.5. You will receive AED1426.5, while the total amount due is AED 1621.5. The repayment plan is AED540.5 per month, among which AED500 is the principle and AED40.5 the interest fees.\n\nThere are only three requirements:\n● UAE Resident\n● 20-50 years old\n● Have a monthly income\n\nGet an instant loan in 5 simple steps:\n● Download our CashNow Loans app for FREE now!\n● Simple & fast advance loans application process. Apply money loans based on the amount you need.\n● Provide basic information and bank details\n● Submit an application for approval\n● The approved amount will be credited into account within 3 working days\n\nAddress：2312, Addax Office Tower, Al Reem Island, Abu Dhabi, U.A.E\nEmail address: help@cashnow.ai\n\n\n        more\n      \n",
        "rating": "2.3"
    }
}