{
    "rank": "60",
    "title": "MadaLoan-cash online loans app",
    "company": "    Quark financing corp.",
    "url": "https://apps.apple.com/ph/app/madaloan-cash-online-loans-app/id1542176840",
    "detail": {
        "description": "\n\nMadaLoan provides a fast, secure and affordable loan for your financial needs.\n\nMadaLoan Product Introduction\n- Long term: 91-180 days, the specific period must be determined by credit evaluation;\n- Ultra-low interest rates: The annual percentage rate (APR): up to 24%/year,no need to worry about interest rates, to provide Filipinos with interest rates that suit them;\nFor example, if the loan amount is PHP10.000 and the interest rate is 24%, the interest that will be paid is: 10.000 * 24%* = PHP2.400\n\nTerms Of Loan\nIf you are a Filipino citizen and your age is more than 18 years old, you can apply for a loan here.\nPrivate Policy: Everyone who is in MadaLoan is our most important friend. We will keep confidential for every user who submits the information. Not available to either party.\n\nService Feature\nA. Flexible interest rates according to personal need\nWe adjust our interest based on personal credit, and each person's repayment rate may vary, daily interest rate can be as low as 0.1%.\nMaintaining healthy repayments will make it possible for you to get higher loan amount and lower interest rates.\nB. Get Cash In A Flash\nWe offer loans ranging from ₱3,000 up to ₱20,000. Once you get a call from our credit specialist, the money will be sent to your account as fast as!\nC. Your information is safe and reliable\nTo ensure that you can apply your loan with MadaLoan quicker and get a higher loan amount, application will require a government-issued ID and a photo of the information used to verify your identity. All information provided will be protected and will never be shared without your consent.\n\nWe hope you will enjoy our loan products and hope that you can share them with your friends and family. Let them come together to experience our products.\nOur goal is to be the leader of inclusive finance and your trusted financial partner! Our goal is to make finance at your fingertips!\n\nHow Dose MadaLoan Work?\n1. Download MadaLoan APP select the cash loan/credit amount and term.\n2. Fill out the application with 3 steps.\n3. Get a call from our team for updates and application status.\n4. Receive the money in your Bank/E-Wallet/Gcash/M.Lhuillier/RD Pawnshop Account.\n\nIf you have any questions, you can contact customer service:\nTel：09190798479 (9:00-18:00)\nEmail：CS@madaloan.com\nAddress:Markati Avenue, Metro Manila\n\n\n        more\n      \n",
        "rating": "3.9"
    }
}