{
    "rank": "9",
    "title": "CIMB Bank Philippines",
    "company": "    CIMB Bank Philippines, Inc.",
    "url": "https://apps.apple.com/ph/app/cimb-bank-philippines/id1603056657",
    "detail": {
        "description": "\n\nYou can now go Beyond Banking with the all-new CIMB Bank PH app!\n\nFast & Easy Sign Up Process\nGet a faster, more seamless, and all-digital onboarding experience. Apply for and access all your CIMB Bank products including deposits, loans, and REVI Credit seamlessly on the app.\n\nFast & Seamless Transactions\nNow with Instapay! You can now enjoy FREE instant fund transfers, a more interactive dashboard, and more billers. You can also continue to enjoy performing transactions through PESONet, 7-Eleven, and Dragonpay.\n\nTotal Control On All Your Accounts\nManage all your accounts anywhere, anytime! Get full control with schedule transfers, 'Add to Favorites,' download e-statements, debit card management, and auto-debit for Personal Loan payments.\n\nTransact with Peace of Mind\nYour account and savings will be in much safer hands. Be at ease with the app's enhanced security measures with biometric login, seamless verification process, card and transaction limit controls, and real-time account notifications.\n\nOUR PRODUCTS:\n\nUpSave Account – Earn up to 1600% higher interest than leading traditional banks in the country! Grow your savings with one of the best market rates in the Philippines. Get monthly interest payout with no maximum cap on deposits and no lock-up period.\n\nGSave Account – Link your GSave to the all-new CIMB Bank PH app and unlock the full features of your account. Start growing your savings and earn up to 1600% higher interest than leading traditional banks in the country! Get dual access to your funds and remove the deposit cap and expiration.\n\nPersonal Loan – Get your money fast and straight to your account of choice!\nApply using only one ID and one payslip through the app and borrow up to PHP 1 million with ZERO early settlement fees and ZERO disbursement fees if you opt to disburse your loan to your CIMB savings account.\n\nREVI Credit - REVI Credit by CIMB Bank is an all-in-one always-ready credit product that offers users a convenient and safe access to revolving credit. Customers can have ready cash anytime, anywhere. If you do not use your credit line, you will not be charged with any additional interest or fees. Moreover, you can replenish your credit line just by settling your balance anytime.\n\nGCredit - GCredit is a revolving mobile credit line on the GCash app that you can use to pay for goods and services in GCash QR-accepting merchants, shop online in selected e-commerce merchants, and pay for bills in the “Pay Bills” feature on the GCash app!\n\nGo Beyond Banking with CIMB Bank. Download the all-new CIMB Bank PH app now!\n\nCONTACT US\nFor questions or concerns, you can call us at #2462 (#CIMB) from 6:00 AM to 10:00 PM daily.\n\nDeposits are insured by PDIC up to P500,000 per depositor.\nCIMB Bank Philippines, Inc. is regulated by the Bangko Sentral ng Pilipinas as a Commercial Bank. You may contact the BSP Financial Consumer Protection Department at (+632)8708-7087 or consumeraffairs@bsp.gov.ph for any concerns regarding the Bank or its products or services.\n\n\n        more\n      \n",
        "rating": "1.8"
    }
}