{
    "rank": "82",
    "title": "Pedicash PH",
    "company": "    Whale Tail Lending Services",
    "url": "https://apps.apple.com/ph/app/pedicash-ph/id1583725404",
    "detail": {
        "description": "\n\nPwede fast basta Pedicash!\n\nRequirements:\nAny functioning smartphone\nPediCash App\nOne (1) Valid ID\n\nHow do I Apply?\nDownload the PediCash App\nGo through the quick registration process\nVerify your identity\nWait for approval\n\nWhat do I need to register?\nUpload one (1) VALID ID\nNO OTHER REQUIREMENTS NEEDED\n\nHow are your privacy and permissions policies?\n\nPedicash values your privacy. The submitted photo of your government-issued ID and other personal information will be used to verify your credit profile on our system. We will NEVER share any of your information without your direct consent or explicit permission.\n\nOn the app, we will require the following permissions to verify your identity:\nLocation Access - To auto-verify your address.\nContacts Access - To easily nominate your contact references.\nCamera Access - To scan your ID to complete ID verification\n\nHow safe are my personal details?\nAll personal details are fully secure and protected\nData privacy agreements are insisted upon registering\nRoutine assessments are done to ensure quality data protection\n\nHow and how fast can I receive the cash?\nApproval of loan application can take upto 5 minutes to 24 hours\nUpon approval, expect same-day disbursement through Skypay\nCash-out centers: RD Pawnshop and M Lhuillier\nOther withdrawal channels: Bank Transfer, GCash or Coins.ph\n\nHow do I repay my loan?\nPayment can be partial or in full, as long as it is within the loan period\nYou may check your loan term duration on the app\nPay through our select payment channels ONLY: RD Pawnshop, M Lhuillier, 7-Eleven, True Money, EC Pay and GCash\n\nWhat loan term packages do you offer?\n\nWe offer a variety of packages depending on your VIP Level\nLoan Amount: Php 2,000 - Php 20,000\nLoan Duration: 60 - 120 days\nMaximum APR: 20%\nTransaction fee: Php 0 - Php 150\nOther fees: Service fee from 10-20%\n\n\nPRODUCT INFORMATION\n-Amount:₱3,000-₱30,000\n-Term: 90days-360 days\n-Service fee: 3%-5%\n-Transfer Fee: ₱0-₱200\n-APR: 18%\n\n\nExample:\nLoan Amount: ₱ 20,000\nLoan Term:180-days\nwith Interest rate: 18%\nTransfer fee:  ₱ 0\nService fee is ₱ 600\nTotal service fee and interest will be ₱ 2,400 pesos.\nTotal received amount is ₱19,400\nNo monthly payment\nTotal repayment for 180 days is ₱ 21,800 (20,000*18%/360*180+20,000) only pay  on the due date.\n\n\n*Reminder: always check the fees, charges and terms and conditions of your loan offer before accepting your loan.\n\n\n\n\n\nWhy choose Pedicash?\n\nPedicash offers all the basic features available in any other app:\nSimple and straightforward application process\nMultiple layers of account security\nFast and reliable cash disbursement\nRegular events and promos\n\nWhat sets Pedicash apart from any other loaning app is that our upward movement is faster than any other app. Using our app allows you to increase your VIP level with just a few loan applications, giving you:\nIncreased Loan Amounts\nIncreased Loan Durations\nLower Processing Fees\n\nWhat are you waiting for? Download the APP now and be part of our Pedicash Family!\n\n\nContact Us\nPedicash is one of the newest Micro-Lending applications catered to giving Filipinos a quick and reliable loaning experience. Pwede Fast Basta Pedicash!\nFor questions, feedbacks, or concerns, please contact us at:\nWebsite: www.pedicash.ph\nFacebook: https://www.facebook.com/pedicashph\nEmail: info@pedicash.ph\n\nPlease visit us on our FB page for the latest updates to the PediCash FAQs\n\nAll loans under the PediCash App are financed by Fund Quest Lending Services Corporation, with SEC Registration (under processing)\n\n\n        more\n      \n",
        "rating": "3.3"
    }
}