{
    "rank": "49",
    "title": "ACOM – Fast Cash Loan. Simple.",
    "company": "    ACF",
    "url": "https://apps.apple.com/ph/app/acom-fast-cash-loan-simple/id1543152824",
    "detail": {
        "description": "\n\nACOM strives to help you with your personal financial worries. No-comaker, no collateral. Fast and Simple.\n\nACOM strives to help you with your personal financial worries. No-comaker, no collateral. Fast and Simple.\nACOM means \"Affection, Confidence, and Moderation\" the spirit in which we want to be remembered by our customers.\nACOM has been ranked as one of the largest and well recognized consumer finance companies in Japan and has established a strong record of innovation within the industry. Now venturing its way to the Philippines.\n\nEasy repayment centers\nEC Pay (7-eleven), Bayad Center\nMultiple receiving channels\nYou can get it thru LBC Branch, Personal Bank Account via Dragonpay, G-Cash\n\nWhy Choose ACOM?\nLegit - ACOM is one of the Leading Personal Loan Companies in Japan and is Authorized and Registered by the SEC. in the Philippines.\nLower Interest Rate - Interest rate per month is diminishing from 4.563% – 3.315% if you pay early.\nFast - Online application takes minutes. You may get the result within the day at the shortest depending on the evaluation.\nSecured - We take data privacy very, very seriously and we assure you that your personal data is safe with us.\nEasy Monthly Repayment – We made repaying as easy as possible requiring monthly and minimum payment just settle the amount any time prior its due date.\nNo Co-maker and Collateral - No need to provide any specific property or bother any person for repayment.\n\nFor more questions and inquiries visit our FAQs section at: www.acom.com.ph/faqs\n\nRepresentative Example: Borrow 10,000 PHP for 12 months with an interest rate of 4.563%, your monthly repayment will only be 1100 PHP, but can also be paid with at least a minimum amount of the 8% of the total outstanding principal balance 10,000 x 0.08% = 800 PHP.\nTerms: 6 months – Flexible months\nAmount: 5,000 – 500,000 PHP\nInterest Rate: 3.315% – 4.563% mo. | APR = 39.78% – 54.756%\nDisclaimer: Loan amount, monthly amortization & applied rate shall be confirmed in your loan docs. Loan approval shall be subject to the submission of required docs., ACOM’s credit policies & procedures.\nPlease review our terms and conditions before proceeding with the loan transaction.\nBy ACOM Consumer Finance Corporation\nSEC Registration Number: CS201724897\nCertificate of Authority to Operate as a Financing Company: 1140\n\nVisit our website: www.acom.com.ph\nLike us on Facebook: facebook.com/acom.com.ph\n\n\n        more\n      \n",
        "rating": "3.0"
    }
}