{
    "rank": "32",
    "title": "PHPocket",
    "company": "    MYCASH LENDING INVESTORS INC.",
    "url": "https://apps.apple.com/ph/app/phpocket/id1614199090",
    "detail": {
        "description": "\n\nPHPocket is one of the online loan service platforms in the Philippines, which provides online loan services for Filipinos who are short of funds.\nNot enough funds! No need to worry now, PHPocket solves all problems for you!\nProduct introduction: PHPocket is a mobile application online loan APP, focusing on providing micro-credit loan services for individuals and small business owners in the Philippines. If the money is not enough, PHPocket will help you solve and solve all your troubles caused by money.\nWho can borrow?\nOnly need to be over 18 years old\n\nHow much can I borrow?\nThe higher your credit score, the more loan you can get.\nLoan amount: Php2,000-Php20,000. As for the actual loan amount, you can adjust it according to your needs.\nFlexible loan term options, with interest starting from 1%.\nThe minimum repayment period is 91 days and maximum is 120 days.\nLoan interest: up to 36%/year (APR)\nTransaction fees: zero\n\nE.g:\nLoan amount: Php20,000\nTransaction fees: zero\nLoan period: 120 days\nTotal payment: Php22,367 (Php20,000*36%*120/365+Php20,000=Php22,367)\nThe above percentages include applicable taxes.\n\nPHPocket borrowing only requires four steps:\nDownload and install PHPocket, and complete the registration.\nChoose the required loan amount and repayment time.\nFill in the certification information online and submit the application\nGet your loan\n\nOur advantages:\n1. Convenient operation: download the app, submit information online, and select the loan amount.\n2. Fast approval and payment: You can get loan approval within 7 minutes at the fastest, and the loan funds will be deposited into your bank account in real time!\n3. No collateral: PHPocket is a completely  no collateral online peso lending platform. This means you don't need to provide any collateral. Only ID card loan is required.\n4. Privacy and security: PHPocket will protect all users' information. Without prior consent, we will not release your personal data to a third party, which is safe and reliable!\n5. Flexible choice: Flexible choice: extendable loan term, reloan after repaid , multiple loan methods, loan after repayment, multiple loan methods.\n6. Convenience of repayment: a variety of repayment methods can be selected: Convenience store\n(7-11, M. Lhuillier), bank transfer, electronic wallet, etc.\n\nAbout Us\nCompany Name: MYCASHLENDING INVESTORS INC.\nCertificate of Authority No. 2814\nCompany Registration No.CS201840987\nTel: 09759461419(global)/09759461420(smart)\nAddress:12 Floor Aseana Three Bldg., Macapagal Ave. Cor Aseana Ave., Aseana City Tambo City of Parañaque Fourth District, Parañaque City,Philippines\n\n\n        more\n      \n",
        "rating": "4.7"
    }
}