{
    "rank": "58",
    "title": "CashBee: Online Peso Cash Loan",
    "company": "    Cashbee Lending Services Incorporated",
    "url": "https://apps.apple.com/ph/app/cashbee-online-peso-cash-loan/id1512931226",
    "detail": {
        "description": "\n\nEnjoy fast and reliable online peso cash loan with fast cash disbursement, easy payment terms and low interest rates with Cashbee! It is a safe and secure online mobile loan app designed to give Filipinos access to financial credit and success.\n\nYou’ll receive your cash loan thru your bank account, GCash, Coins.ph wallet or the nearest RD & M Lhuillier Pawnshop within 5 minutes upon approval.\n\nNo paperwork needed. No collaterals, no co-guarantor required.\n\nRequirements:\nAny functioning smartphone\nCashbee App\nOne (1) Valid ID\n\nHow do I Apply?\nDownload the Cashbee App\nEasy registration process\nVerify the information you’ve provided\nWait for approval\n\nWhat do I need to register?\nJust upload one (1) valid Government-Issued ID!\n\nWhat are the privacy and permission policies of Cashbee ?\nYour privacy is our topmost priority! The submitted documents upon your registration will be used to verify your credit profile on our system. We will NOT share any of your data without your direct consent or explicit permission for any purpose.\n\nOn the app, we will require the following permissions to verify your identity:\nLocation Access - To auto-verify your address.\nContacts Access - To easily nominate your contact references.\nCamera Access - To scan your ID for complete ID verification\n\nHow safe are my personal details?\nFully secured and protected of all personal details and information\nData Privacy Agreements are insisted upon registering\nStrictly complies to the guidelines set by the NPC\nRoutine assessments are done to ensure Quality Data Protection\n\nHow fast is the approval and where can I receive the loan?\nApproval of loan application can take up to 5 minutes to 24 hours\nUpon approval, expect same-day disbursement through Skypay\nCash-out centers: RD Pawnshop and M Lhuillier\nOther withdrawal channels: Bank, GCash, Paymaya, and Coins.ph\n\nHow do I repay my loan?\nPayment can be partial or in full, as long as it is within the loan period\nYou may check your loan term duration on the app\nPay through our selected payment channels ONLY: RD Pawnshop, M Lhuillier, 7-Eleven, True Money, EC Pay, GCash, Paymaya, and ShopeePay\n\nWhat loan term packages do you offer?\nWe offer a variety of packages depending on your user’s  Level\nLoan Amount: Php 2,000 - Php 20,000\nLoan Duration: 61 - 120 days\nMaximum APR: 20%\nTransaction fee: Php 0 - Php 150\nOther fees: Service fee from 10-20%\n\nPRODUCT INFORMATION\n-Amount:₱3,000-₱30,000\n-Term: 90days-360 days\n-Service fee: 3%-5%\n-Transfer Fee: ₱0-₱200\n-APR: 18%\n\nExample:\nLoan Amount: ₱ 20,000\nLoan Term:180-days\nwith Interest rate: 18%\nTransfer fee: ₱ 0\nService fee is ₱ 600\nTotal service fee and interest will be ₱ 2,400 pesos.\nTotal received amount is ₱19,400\nNo monthly payment\nTotal repayment for 180 days is ₱ 21,800 (20,000*18%/360*180+20,000) only pay on the due date.\n\n*Reminder: Always check the fees, charges, 'Privacy Policy 'and the ‘Terms and Conditions’ of the loan offer before accepting any loan.\n\nWhy choose Cashbee?\nCashbee offers all the basic features available in any other app:\n\nSimple, Easy and Fast Registration Process\nAccessible and Readily Available App\nMultiple Layers of Account Security\nAccommodating Customer Service\nExciting Events and Promos\n\nWhat sets Cashbee apart from any other loaning app is that Cashbee ’s utmost priority is your data privacy. Using our app allows you to increase your  level with just a few loan applications, giving you:\nLonger Loan Duration\nIncreasing Loan Amount\nLower Processing Fees\n\nContact Us\nFor questions, feedbacks, or concerns, please reach us at:\nWebsite: www.cashbee.ph\nFacebook: facebook.com/cashbeeph\nEmail: info@cashbee.ph\n\nCashbee app is operated by Cashbee Lending Services Inc. with Registration No. CS201912321 and Certificate of Authority No. 3041.\n\n\n        more\n      \n",
        "rating": "2.4"
    }
}