{
    "rank": "91",
    "title": "DirectLoan—Online peso loan",
    "company": "    IDIRECT FINANCE COMPANY INC.",
    "url": "https://apps.apple.com/ph/app/directloan-online-peso-loan/id1589565305",
    "detail": {
        "description": "\n\nDirect Loan is a peso loan app for Filipinos by IDIRECT FINANCE COMPANY, INC.\n\nSEC company name:\niDIRECT FINANCE COMPANY INC.\nSEC company registration NO.2021080023709-02\nCERTIFICATE AUTHORITY NO.F-21-0010-64\n\nDirect loan is your partner for a cash loan. We strive to provide convenient and friendly credit loan service to Filipinos. Easy loan application, get funding in pesos, and make your family life better in the Philippines.\n\nProduct Introduction:\nLoan Amount: ₱ 5,000.00 – ₱ 100,000.00\nLoan Term: 91 days (shortest, including renewal time) - 365 days (longest, including renewal time)\nMaximum APR is 24% per year, 2% monthly\nOther Fees: As a credit lending service application Direct Loan will charge different fees according to the product you choose, which costs are used for credit score assessment, account management and third parties.\n\nFor example:\nIf you choose a loan limit of ₱ 5,000.00 with a period of 180 days, the total interest should be paid:\n₱ 5,000.00 * 2% * 6= ₱ 600.00\nmonthly interest shall be paid:\n₱ 5,000.00 * 2% = ₱ 100.00\nmonthly repayment bill including principle and interest shall be paid:\n₱ 5,000.00/6 + ₱ 100.00 = ₱933.34\ntotal repayment bill including principle and interest shall be paid:\n₱ 5,000.00 + ₱ 600.00 = ₱ 5,600.00\n\nWhy choose Direct Loan？\nDirect Loan is a convenient peso online loan App, that offers all the basic features available in any other loan app:\nSimple, Easy and Fast process；\nEasy Approval and fast lending\nLow Interest Rates on loans\nHigh Loan Amount\nLong-term Payment Options\nRepayment by Installments\n\nWho can borrow?\nDirect loan is one of the online loan app for Filipinos. If you are over 20 years old, have a valid mobile phone number and a stable source of income, you can come to Direct Loan to loan money with 2 Valid ID. We will increase the limit and loan period based on your credit score! The more data you provide, the higher your credit score.\n\nOur Vision：Direct loan, For A Better Word\nDirect Loan APP provides instant personal loan help for your urgent cash needs.Our fast cash loan has the automation function online, only 2 Valid ID is needed, which offers you loan in as fast as 3 minutes after approval. Direct Loan provides you a quick loan approval and strive to be the best loan app.\n\nContact Us\nFor questions, feedbacks, or concerns, please contact us at:\nwebsite : https://www.directloan.ph/\nFacebook:https://www.facebook.com/iDirectFinance\nEmail: cs@directloan.ph\nAddress：The Podium West Tower ADB Ave Ortigas Center Mandaluyong, Philippines\n\n\n        more\n      \n",
        "rating": "2.3"
    }
}