{
    "rank": "39",
    "title": "Flip Cash- Peso Online Loan PH",
    "company": "    PRIMA FINTECH (PHILIPPINES) LENDING CORPORATION",
    "url": "https://apps.apple.com/ph/app/flip-cash-peso-online-loan-ph/id1603578566",
    "detail": {
        "description": "\n\n91 araw na hulugan,0.02% lang interes sa isang araw.Mabilis na Pautang ng Pera.Flipcash offers legal digital peso online loans and credit for Filipinos in the Philippines\n\n1.WHO CAN APPLY OUR PESO CASH LOAN APP PHILIPPINES WHEN IN NEED OF ONLINE LENDING？\n- Any persons in the Philippines & 18+ years old\n- At least 1 valid ID & a phone\n- Acceptable Valid IDs: Philhealth ID/ UMID/ SSS/ Pass Port/ PRC ID/ GSIS ID/ Voter's ID/ Postal ID/ Driver License etc.(You can choose one of the above id types)\n\n2. OUR CORE FEATURES & STRENGTHS IN THE ONLINE LENDING APP SECTOR\n• At FLIP CASH - ONLINE LOANS PHILIPPINES, no mortgage required. You only need to use one mobile phone to apply for a peso cash loan with a valid ID card;\n• Principal:Irregularly increase the loan limit amount.If you pay back your peso cash loan on time, the system will automatically record your loan-repayment history, which will be used as a basis for increasing your mobile cash loan and credit limit.Let your credit limit continue to increase;\n• Application:At FLIP CASH - ONLINE LOANS PHILIPPINES, following the 2 simple steps, you can get the cash online lending you need. Download APP, select the credit limit, submit the application;\n• Verification:After submitting, you may receive a call asking your to provide updates, Or further verification of the info you provided;\n• Cash-Out Options:Cash-Out with any local Bank Account, such as unionbank,bdo mobile banking,PNB,RCBC,bpi mobile banking,ing bank,tonik digital bank,landbank,metrobank mobile banking & online E-wallets, such as Gcash,Paymaya,DiskarTech,REVI Credit,ECPay,Grab pay,PalawanPay. Receive disbursement from our partners ASAP. Or pick up your peso cash loan at thousands of ML huillier & Cebuana Lhuillier;\n• Repayment can be done thru online bank, Minimarket(7-11,MLhuillier & Cebuana Lhuillier),UnionBank Online,E-wallet(Gcash, Paymaya,Shopee Pay,CLiQQ 7/11 etc.);\n• No stress in repayment:We offer reasonable installment plans from 91 to 120 days. Keeping your financial stress to minimum.\n\n3.LOAN RATES&FEES-Lower Interest & Longer loan terms\nWe have the right peso cash loan app for your online lending needs.\n• LOAN AMOUNTS:₱1,000.00-₱30,000.00\n• EFFECTIVE APR:34.68%\n• Late fee: Base on outstanding amount due\n• Tax(DST&GRT):1.5%\n• Min repay-period offered:91 days\n• Max repay-period offered:120 days\nFor example, if you choose a 90-day-cash-loan limit of ₱10,000, your cash loan detail is as follows:\nLOAN PRINCIPAL:₱10,000\nLOAN NET PROCEEDS:₱10,000\nInterest due on maturity ₱855(1,0000*90*0.095%=855)\nTotal amount repayable on maturity ₱10,855(10,000*34.68%*(90/365) +10,000=10,855)\nEFFECTIVE DIR(Interest&Other Fee include):0.095%\nEFFECTIVE APR(Interest&Other Fee include):34.68%\n\n4.OUR LENDING LIMIT GROWTH\nKeep your repayment on time. Enjoy our long-term lending limit growth, up to ₱30,000\n\n5. HOW TO REPAY OUR PESO CASH LOAN LOAN?\nRepayment can be done thru online bank, Minimarket(7-11,MLhuillier & Cebuana Lhuillier),UnionBank Online, E-wallet(Gcash, Paymaya, Shopee Pay, ECPay, PalawanPay, CLiQQ-7/11 etc.) TIPS: You can pay the cash loan in full or installment at any time before the due date.\n\n6.Privacy&Permissions\nYour privacy is very important to us. Your personal information will NEVER be shared without your permission. To verify your identity, we require the following app permissions:\nLocation Access-To auto-verify your address\nContacts Access-To easily nominate your contact references\nCamera Access-To scan your IDs to complete ID verification\n\n7.ABOUT US\nFLIP CASH-ONLINE LOANS PHILIPPINES is an online lending app provided by Prima Fintech(Philippines)Lending Corp.SEC Registration No.CS201951100,CA No.2917. We strive to provide better online lending service to Filipinos.Flip Cash is a quality convenient and secure online loans services platform for Filipinos. Get your mobile cash loan and credit anytime, anywhere - whenever and wherever you want.Flip Cash can solve all online lending problems for you.\nEmail: support@primafintech.net.\nCompany address:north penthouse unit,Marajo Tower 312 26th Street Corner 4th Avenue,Taguig City,Philippines\n\n\n        more\n      \n",
        "rating": "4.8"
    }
}