{
    "rank": "55",
    "title": "Cashme -madaling utang sa pera",
    "company": "    Hupan Lending Technology Inc",
    "url": "https://apps.apple.com/ph/app/cashme-madaling-utang-sa-pera/id1480194783",
    "detail": {
        "description": "\n\nCashme - madaling utang sa pera\n\nCashme is a mature online lending APP in conformity with Philippine laws. We have served hundreds of thousands of clients, and holds all certificates such as business permit, BIR, the lending company license issued by SEC and so on.\n\nProduct introduction\nTerm:91 days-120 days\nDaily interest rate: 0.1%/day. Maximum APR: 36%. Service fee: 20%, Gcash transfer fee: 100.\nProduksyonMababang ang interest rate, Fixed and bayaranAng halaga ng aming pautang ay mula sa ₱ 2,000.00 hanggang ₱ 10,000.00, at ang aktwal na halaga ng pautang ay maaaring tumaas ayon sa iyong kakayahan.Ang rate ng interes ay nagsisimula mula sa 0.1% na may nababaluktot na mga pagpipilian sa pautang sa katagaHalimbawa: Ang isang utang na nagkakahalaga ng PHP3000, ay magbabayad ng PHP3210.We adhere to the core values of “Professional, Efficient, Honest, Pursue Excellent Gratitude”, ensuring the safety and standardization of each client's funds.\n\nwhat is Cash me?\nCash me ay isang online loan peso/lending platform sa Pilipinas na pinadali na gamit ang mobile APP,  loan pera/credit service base sa mobile internet security technology at big-data analysis innovation. kumuha ng loan peso kahit kelan at kahit saan- isang click lang ang kailangan.\n\nCashme product major features\n1. Kung ikaw ay isang Filipino at ang iyong edad ay 18 years old pataas , pwede ka nang mag apply nang loan peso, isang valid or government issued ID lang ang kailangan na walang problema sa Id.\n2. Safe and Transparent data security and protection.Nag pro-provide din kami ng protection para sa seguridad ng iyong inpormasyon at klarong rekomendasyon pagdating sa mga terms and conditions.\n\nPano kumuha ng Cash me loan sa unang pagkakataon?\n1. i-download ang Cash me APP, piliin ang halaga ng loan/credit at i-click ang repayment schedule.\n2. Fill-out ang form/application with 4 steps at get approved.\n3. Makakatanggap ng tawag mula sa aming team para sa update ng status ng iyong application.\n4. Sa loob ng 5 mins-24 hours matatanggap mo na ang iyong perang ni-loan.\n\nAbout us\nPlease contact our online service for help.\nWorking time: 9am-6pm (Mon-Sat)\nPHONE: 0997 778 2696\nCompany address: 3 floor, Executive building, Makati Avenue, Makati, Kalakhang Manila\n\n\n        more\n      \n",
        "rating": "4.0"
    }
}