{
    "rank": "22",
    "title": "PNB Digital",
    "company": "    Philippine National Bank",
    "url": "https://apps.apple.com/ph/app/pnb-digital/id1527029568",
    "detail": {
        "description": "\n\n**Easy sign-up**\nRegister without going to the branch. You can use any eligible PNB Savings or Checking account number, PNB Debit Card or Credit Card number to enroll.\n\n**Enjoy safe and secure banking**\nLogin easily using Fingerprint/Touch ID or Face ID. Activate your PNB Digital Key and get added protection from the time you login and do your transactions.\n\n**Send money anytime, anywhere**\nSupport your family or pay for your purchases online -. Send money between PNB accounts ,to other local banks and eWallets with InstaPay and PESONet.\n\n**Settle your monthly bills in just one app**\nSkip the lines and beat the due dates with PNB Digital’s Pay Bills feature. Pay using your debit or credit card.\n\n**eWallet Top-Up**\nTransfer funds directly to an eWallet in real-time with InstaPay.\n\n**Speed up your transactions**\nTransfer funds instantly to your family and friends by scanning their account QR Codes.\n\n**Share your account details safely**\nCreate your PNB account QR Code and share it securely to your payors. No need to enter your account number anymore.\n\n**Pay via QR code**\nScan to pay your online and in-store shops via QR Ph codes\n\n**Manage and monitor your PNB accounts or credit cards**\nView your account balances and transaction history with 24/7 real-time access to your PNB Savings or Checking accounts, or PNB Credit Cards.\n\n**Monitor your PNB time deposits\nAdd and view your active time deposits easily.\n\n**Personalize your PNB Digital App Dashboard**\nAccess your favorite transactions instantly by customizing your dashboard to include service features frequently used.\n\n\nDownload the app now and enjoy an enhanced digital banking experience!\n\nStay tuned as more features will be available soon!\n\n\n        more\n      \n",
        "rating": "2.2"
    }
}