{
    "rank": "7",
    "title": "PayPal",
    "company": "    PayPal, Inc.",
    "url": "https://apps.apple.com/ph/app/paypal/id283646709",
    "detail": {
        "description": "\n\nGET READY FOR THE ALL-IN-ONE PAYPAL APP\nJoin the millions of people who trust PayPal to send, spend, & manage their transactions without sharing financial information.\nThe new PayPal App lets you shop online and in person, send & receive money and raise or donate for a good cause - right from your phone.\n\nSEND & RECEIVE MONEY\nA simple, secure way to quickly send & receive money to family and friends.\nExchange messages to make payments between friends more fun & less awkward & more interesting with our animations, emojis & range of themes.\nWith encryption technology, we go the distance to help make sure your money transfers are secure.\n\nSEND MONEY GLOBALLY\nTransfer money using our Xoom service to 130+ countries, even if the recipient doesn't have a PayPal or Xoom account.\n\nCRYPTO\nBuy, sell, and hold Crypto. Conveniently explore crypto with confidence in the PayPal app.¹\n\n1PayPal account required. Terms apply. GBP service only available in the UK. Buying & selling cryptocurrency is subject to a number of risks & may result in significant losses & the loss of the entire amount you have paid. Cryptocurrency is volatile. The value of cryptocurrency can rise or fall suddenly so you can lose money just as easily as you can make it. Cryptocurrency sales can be taxable. You can buy, hold & sell cryptocurrency through PayPal’s cryptocurrency service, but you can’t use it to send cryptocurrency. Purchases & sales of cryptocurrency aren’t reversible & cannot be changed. None of the information provided by PayPal should be taken as tax, financial, legal, trading or investment advice. Consider seeking advice from your financial or tax adviser. PayPal’s cryptocurrency service is not regulated by the UK Financial Conduct Authority or the Luxembourg Commission de Surveillance Du Secteur Financier. Therefore, if something goes wrong with the cryptocurrency, you won’t be able to use the UK Financial Ombudsman Service, the European Consumer Center or have the protection of any UK or Luxembourg Financial Services Compensation Scheme.\n\nBUY NOW, PAY LATER\nKeep track of all your PayPal Pay in 3 and PayPal Credit repayments.2\n2 Subject to status. UK residents only. Late fees apply for purchases made on or before 30 September 2021. PayPal is a responsible lender. Pay in 3 performance may influence your credit score. T&Cs apply.\n\nPAY IN PERSON\nPaying in person is as easy as scanning a QR code at checkout - and it's contactless. You don't have to handle cards, or cash, simply use the app.\n\nPAY HOW YOU WANT\nAdd your debit or credit cards or link your bank accounts for extra flexibility at checkout. You'll even be able to continue collecting rewards points.*\n*subject to credit card provider\n\nGET INSTANT NOTIFICATIONS\nWhether shopping at your usual store or somewhere new, we help keep checkout fast & your eligible purchases protected. You also get instant spend notifications, so you can easily keep track of all your online hauls.\n\nKEEP YOUR BILLS IN ONE PLACE\nManage your subscriptions & household bills, all from one place.\n\nDONATE & RAISE FOR A GOOD CAUSE\nGive to support causes you care about through the app or at checkout.\nRaise money for yourself, friends in need, or local businesses that need a boost.\n\nPayPal (Europe) S.à r.l. et Cie, S.C.A. is duly licenced as a Luxembourg credit institution in the sense of Article 2 of the law of 5 April 1993 on the financial sector as amended and is under the prudential supervision of the Luxembourg supervisory authority, the Commission de Surveillance du Secteur Financier, with registered office in L-1150 Luxembourg. Deemed authorised & regulated by the Financial Conduct Authority. The nature & extent of consumer protections may differ from those for firms based in the UK. Details of the Temporary Permissions Regime, which allows EEA-based firms to operate in the UK for a limited period while seeking full authorisation, are available on the Financial Conduct Authority’s website.\n\n\n        more\n      \n",
        "rating": "4.6"
    }
}