{
    "rank": "18",
    "title": "Prima Cash Loan App Philippine",
    "company": "    PRIMA FINTECH (PHILIPPINES) LENDING CORPORATION",
    "url": "https://apps.apple.com/ph/app/prima-cash-loan-app-philippine/id1591581052",
    "detail": {
        "description": "\n\n91 na araw na hulugan sa pautang ng Pera. We offer 0.02% interest rate peso cash online loan app in the Philippines Easy Online Lending, Instant Disbursement, 0 Pressure.\n\nPrima Cash provides non-collateral required Installment online loan app philippines to every Philippine Borrower to help every Filipino solve their needs for online lending - your trusted at our peso cash online lending partner!You can apply for a peso cash online loan, any time, any place!\n\n• WHY CHOOSE US WHEN YOU NEED A PESO CASH ONLINE LOAN?\n\n-Online Lending App Approval & Disbursement\nGet your peso cash online loan & credit approved and funding to your Gcash account ASAP!\nCash-Out with any local Bank Account,such as unionbank,BPI,PNB,RCBC,BDO mobile banking,ING bank,tonik digital bank,landbank,metrobank,Or online E-wallets,as Gcash,Paymaya,DiskarTech,ECPay,Grab pay,PalawanPay.Or pick up your peso loan in cash at thousands of MLhuillier & Cebuana Lhuillier\n\n-Lower Interest at our peso cash online loan\nAnnual interest rate(APR): up to 36%\nFees: processing fee, service fee. Minimum 10.5%, Maximum 36%. Based on the amount of loan you are applying for\n\n-Longer Loan Periods at our peso cash online loan\nTerm of loan: 91 days - 240 days (longest, including renewal time)\nMore rational amortization schedule: 91D Installment plan with no repay-pressure\n\n-Easy Online Loan App Application Process\nApply a peso cash loan 24/7 in our easy-to-navigate app\nJust need to upload ONE government issued ID\nNO COLLATERAL NEEDED\n\n-LONG-TERM PESO CASH ONLINE LOAN CREDIT LIMIT GROWTH\nRepay your loan on time, up to 30,000\n\n-REWARDING AT OUR PESO CASH ONLINE LOAN\nMake your online loan payments on time and earn reward-point. Redeem your exclusive rewards before next due-date\n\n• HOW OUR PESO CASH ONLINE LOAN MOBILE APPLICATION WORKS\n\n-Download Prima Cash - loan app philippines\n-Apply a peso cash online loan in minutes. Fill out our loan application and verify your identity with 1 ID\n-Choose your terms&Loan Credit. Confirm your loan amount, due date, and cash-out option\n-Get your peso cash loan. Your online lending funds sent directly to bank account,GCash,Or pick up at MLhuillier & Cebuana Lhuillier\n-Repay easily via GCash,CLiQQ 7/11,MLhuillier or Cebuana Lhuillier!You can repay cash loan in full or make installment payments, anytime on/or before due date\n\n• USER REQUIREMENTS-WHO CAN APPLY A LOAN?\n-Philippine nationalities\n-Aged above 18\n-Acceptable Valid IDs:Philhealth ID/ UMID/ SSS/ Pass Port/ PRC ID/ GSIS ID/ Voter's ID/ Postal ID/ Driver License(You can choose one of the above).\n\n• LOAN RATES&FEES\n\nWe have the right loan product for your needs,from ₱3,000 to ₱40,000\nFor example, if you choose a 90-day loan limit of ₱40,000, your loan detail is as follows:\nLoan Principal:₱40,000\nProcessing Fee:₱0.00\nService Fee:₱0.00\nNET PROCEEDS OF LOAN:₱40,000\nInterest due on maturity:₱3,420 (40,000*90*0.095%=3420)\nTotal amount repayable on maturity:₱43,420(40000*34.68%*(90/365)+40000=43420)\nEFFECTIVE DIR (Interest&Other Fee include):0.095%\nEFFECTIVE APR (Interest&Other Fee include):34.68%\n\n***\n• Privacy&Permissions\nYour privacy is very important to us. Your personal information will never be shared without your direct and explicit permission.\nTo verify your identity, we require the following app permissions:\nLocation Access-To auto-verify your address\nContacts Access-To easily nominate your contact references\nCamera Access-To scan your IDs to complete ID verification using PrimaCash’s facial recognition\n\n• ABOUT US\nPrima Cash is a product of Prima Fintech(Philippines)Lending Corp. (SEC No.CS201951100,CA No.2917). PrimaFintech is a legally registered lending company in the Philippines. Its products comply with the policies and regulations, and all business activities are subject to the policies and our online lending services is based on mobile security-tech. We provide cash online loan app Philippines.\nCompany address:north penthouse unit, Marajo Tower 312 26th Street Corner 4th Ave.,Fort Bonifacio,TaguigCity,Philippines\nOther Questions:\nEmail: support@primafintech.net\nWorking time: 9:00- 17:30\n\n\n        more\n      \n",
        "rating": "4.7"
    }
}