{
    "rank": "85",
    "title": "Splitwise",
    "company": "    Splitwise, Inc.",
    "url": "https://apps.apple.com/ph/app/splitwise/id458023433",
    "detail": {
        "description": "\n\nSplitwise is the easiest way to share expenses with friends and family and stop stressing about “who owes who”. Millions of people around the world use Splitwise to organize group bills for households, trips, and more. Our mission is to reduce the stress and awkwardness that money places on our most important relationships.\n\nSplitwise is great for:\n- Roommates splitting rent and apartment bills\n- Group trips around the world\n- Splitting a vacation house for skiing or at the beach\n- Weddings and bachelor/bachelorette parties\n- Couples sharing relationship costs\n- Friends and co-workers who go out to lunch or dinner together frequently\n- Loans and IOUS between friends\n- And so much more\n\nSplitwise is simple to use:\n- Create groups or private friendships for any splitting situation\n- Add expenses, IOUs, or informal debts in any currency, with support for offline entry\n- Expenses are backed up online so everyone can log in, view their balances, and add expenses\n- Keep track of who should pay next, or settle up by recording cash payments or using our integrations\n\nWe also have powerful features that can handle almost any money sharing situation. Here are some of our industry-leading features:\n- Multi-platform support for smartphones and web\n- Simplify debts into the easiest repayment plan\n- Expense categorization\n- Calculate group totals\n- Export to CSV\n- Comment directly on expenses\n- Split expenses equally or unequally by percentages, shares, or exact amounts\n- Add informal debts and IOUs\n- Create bills that reccur monthly, weekly, yearly, fortnightly\n- Add multiple payers on a single expense\n- See total balances with a person across multiple groups and private expenses\n- Custom user avatars\n- Cover photos for groups\n- Activity feed and push notifications help you stay on top of changes\n- View your edit history for changes to an expense\n- Any deleted group or bill can be restored easily\n- World-class customer support\n- Pay back using our integrated payments: Venmo and PayPal (US only), Paytm (India only)\n- 100+ currencies and growing\n- 7+ supported languages\n\nEndorsements:\n“Makes it easy to split everything from your dinner bill to rent.” - NY Times\n\"Fundamental for tracking finances. As good as WhatsApp for containing awkwardness.\" – The Financial Times\n“I never fight with roommates over bills because of this genius expense-splitting app”- Business Insider\n“The Single Best App You Can Download for Group Trips of Any Kind” - Thrillist\n“Life Changing! I don’t review many things, but this app has seriously improved my quality of life. It has saved my sanity when it comes to splitting utilities, mortgage, groceries, dog expenses...the list goes on. No more saving receipts, making spreadsheets, and manually calculating each month. So handy for group trips/weekends, too! THANK YOU!!” – Courtney via the App Store\n\nWe offer in-app purchases for “Splitwise Pro”, the benefits of which are described below. The subscription amount will be charged to your App Store account and will vary by plan and country. You’ll see the total price before completing your first payment. If you don’t choose to purchase “Splitwise Pro”, you can continue using Splitwise for free.\n\nPremium Subscription Service “Splitwise Pro”:\n1. Store high-resolution receipts in the cloud (10GB cloud storage)\n2. OCR integration for scanning and itemizing receipts\n3. Backups to JSON, downloadable from our website\n4. Convert expenses to different currencies using our Open Exchange Rates integration\n5. Access to “spending by category” budgeting tools and other charts\n6. Search full expense history\n\n“Splitwise Pro” subscriptions purchased in-app renew monthly or yearly depending on your plan. Plan pricing may vary by country. To avoid renewal, you must turn off auto-renew at least 24 hours before your subscription ends. You can turn off auto-renew at any time by visiting the App Store.\n\nTerms of Service and Privacy Policy: https://www.splitwise.com/terms\n\n\n        more\n      \n",
        "rating": "4.8"
    }
}