{
    "rank": "78",
    "title": "MetaTrader 4",
    "company": "    MetaQuotes Software Corp.",
    "url": "https://apps.apple.com/ph/app/metatrader-4/id496212596",
    "detail": {
        "description": "\n\nConnect to hundreds of brokers and trade on currency markets from the MetaTrader 4 for iPhone or iPad!\n\nThe mobile trading platform allows you to perform trading operations and analyze currency quotes using technical indicators and graphical objects.\n\nRisk Warning: Our programs may involve real trading with a high risk of losing money rapidly. Most retail investor accounts lose money when trading financial products. You should consider whether you understand how various financial products work and whether you can afford to take the high risk of losing money.\n\nTRADING\n\n• Real-time quotes of financial instruments\n• Full set of trade orders, including pending orders\n• Trading from charts in iPad\n• All types of trade execution\n• Complete trading history\n\nADVANCED FUNCTIONALITY\n\n• High-performance charts\n• Customizable chart color scheme\n• Configuring properties of graphical objects and indicators\n• Display of four charts in one window available on iPad\n• Trade levels visualizing the prices of pending order, as well as SL and TP values on the chart\n• Information window that displays orders, trading history, emails, news, and logs on iPad\n• Sound notifications\n• Financial news — dozens of materials daily\n• Secure and fast chats with other traders, creation of group chats and channels\n• Support for push-notifications from the desktop platform and MQL5.community services\n\nTECHNICAL ANALYSIS\n\n• Interactive real-time price charts with zoom and scroll options\n• 30 most popular technical indicators\n• 24 analytical objects: lines, channels, geometric shapes, as well as Gann, Fibonacci and Elliott tools\n• 9 timeframes: M1, M5, M15, M30, H1, H4, D1, W1 and MN\n• 3 types of charts: bars, Japanese candlesticks and broken line\n\nDownload MetaTrader 4 and trade on currency markets!\n\nTo trade using real money, you need to open a real trading account by entering into a separate agreement with a financial company (broker), which has installed the server component of the MetaTrader 4 trading platform and has the appropriate permissions to provide financial trading service in their respective country. MetaQuotes is a software company and does not provide financial services, nor it has access to MetaTrader 4 platform servers and databases managed by financial companies.\n\n\n        more\n      \n",
        "rating": "4.8"
    }
}