{
    "rank": "89",
    "title": "XLKash Lending",
    "company": "    XLKash Lending Corp.",
    "url": "https://apps.apple.com/ph/app/xlkash-lending/id1589351964",
    "detail": {
        "description": "\n\nXLKash is an online lending app powered by XLKASH LENDING CORP. SEC Registration No. CS201917309. CA No. 3136.We strive to provide better loan services for Filipinos. Before making a loan transaction, please read and review the terms and conditions in the disclosure statement.\n\nAPP FEATURES:\nLoan period: 91 days (the shortest, including renewal time)-120 days (the longest, including Update time)\nLoanable amount: P2000-P15,000\nAnnual interest rate (APR): up to 32%\nprocessing fee:0\nFor example,\nloan amount: P4000\nLoan term: 91 days\nDaily interest rate：0.08%=32%/360\nThe interest fee is P323.56= P4000*(32%/360)*91\nIf you pay on time,your monthly repayment is P1441.19,\nTotal repayment for 91days is P4323.56=P4000+P323.56(interest fee)\n\nHow does it work?\n-Filipinos age 18 and above\n\nWhat are the requirements for the application?\n-Valid Government ID\n\nFind XLKash Lending on App Store\n-Download and register with your phone number\n-provide your information\n-expect loan application processed in as fast as 30 minutes\n-choose from several channel for disbursement\n\nBorrow money with our XLKash Lending - Your to-go loan app in the Philippines!\nXLKash Lending App provides instant personal loan. Our Fast cash app offers you loan in as fast as 30 minutes. Only 1 valid ID is needed. XLKash Lending online loan app is a modern way of cash lending in the Philippines with fully automated features. XLKash Lending loan online provides you a quick loan approval and strive to be the best loan app in the Philippine market.\nThe loan application process is completely digital and hassle-free, you can apply when you are at home, at the office, or even commuting. Use XLKash Lending now to fulfill your emergency cash needs like shopping, travel, education, medical expenses, etc.\n\n\nFrequently Asked Questions\nPlease visit http://xlkashlending.com/\nCustomer Care: cs@xlkashlending.com\nAddress: 19th Floor, Marco Polo Ortigas Pasig\n\n\n        more\n      \n",
        "rating": "3.2"
    }
}