{
    "rank": "35",
    "title": "Pautang Cash- Peso Online Loan",
    "company": "    PRIMA FINTECH (PHILIPPINES) LENDING CORPORATION",
    "url": "https://apps.apple.com/ph/app/pautang-cash-peso-online-loan/id1599241853",
    "detail": {
        "description": "\n\nWe offer 0% interest Insta peso cash online loan app in the Philippines for Filipinos. Easy Online Lending Application, Instant Disbursement. Mabilis na Puatang ng Pera.\n\n1.PANGUNAHING TAMPOK\n- Online ang Proseso at Pag- Apruba\n- Insta Pera Utang for Filipinos\n- Mababang Interest Rates at Mas Mahabang Panahon ng Pautang\n- Maginhawa at Madaling Proseso ng Application. Isang (1) valid ID lang ang kailangan\n\n2.Paano Humiram\n- I-download ang aming application.\n- Magrehistro ng personal na account sa app.\n- Punan ang personal na impormasyon.\n- Pagsusuri ng pautang at pag-disbursement ng pera\n\n3.WHO CAN APPLY OUR ONLINE LOAN APP PHILIPPINES？\n- Any Filipinos in the Philippines and 18+\n- At least 1 valid ID and a phone number\n- Acceptable Valid IDs: Philhealth ID/ UMID/ SSS/ Pass Port/ PRC ID/ GSIS ID/ Voter's ID/ Postal ID/ Driver License etc. ( You can choose one of the above id types.)\n\n4.WHY CHOOSE US, WHEN YOU HAVE A NEED FOR PESO CASH LOAN?\n• KEY FEATURES OUR ONLINE LOAN APP PHILIPPINES\n- At Pautang Cash - online loan app philippines, no mortgage required. You only need to use the phone to apply for a peso cash loan with 1 ID\n- Application: At Pautang Cash, following the 2 steps, you can get your online peso cash loan\n- Verification: we offers quality online loan service in the Philippines, after submitting the application, you may receive a call asking them to provide updates from our team\n- Payment: Receive payment from our partners ASAP. Send your peso cash loan directly to your own bank peso account or online peso E-wallets, such as GCash, Pay Maya and Grab Pay. Or pick up your loan in peso cash at thousands of MLhuillier cash loan site and cebuana express.\n- Repay easily via GCash, 7-11! You can pay your peso cash loan in full or partial payments, anytime on or before your loan due date\n\n5.LOAN RATES&FEES - 0% Interest & Longer loan periods\nWe offer the online loan product for your lending needs.\n• LOAN AMOUNTS: ₱3,000 - ₱30,000\n• LOAN EFFECTIVE APR: 34.68%\n• Loan Late Fee: Base on outstanding amount due\n• Tax (DST & GRT): 1.5%\n• Min repayment period offered = 91 days\n• Max repayment period offered = 120 days\n\nFor example, if you choose a 90-day peso cash loan limit of ₱10,000, your online lending detail is as follows:\nLoan Principal ₱10,000\nLoan Processing Fee ₱0.00\nLoan Service Fee ₱0.00\nNET PROCEEDS OF LOAN ₱10,000\nInterest due on maturity ₱855 (₱1,0000*90*0.095%=₱855)\nTotal amount repayable on maturity ₱10,855(₱10,000*34.68%*(90/365) +₱10,000=₱10,855)\nEFFECTIVE DAILY INTEREST RATE：0.095%\nEFFECTIVE LOAN APR：34.68%\n\n6.LENDING LIMIT GROWTH: HOW MUCH YOU BORROW IN OUR ONLINE PESO CASH LOAN APP ?\nBuild Your Lending Credit History. Keep your repayment on time. Enjoy our long-term limit growth, up to ₱30,000.\n\n7. HOW TO REPAY OUR ONLINE LOAN APP PHILIPPINES?\nVisit any branch of 7-Eleven, GCash, MLhuillier, Cebuana\nYou can pay your peso cash loan in full or in part at any time before the due date.\n\n8.Privacy & Permissions\nYour privacy is very important to us. Your personal information will never be shared without your direct and explicit permission.To verify your identity, we require the following app permissions:\n\nContacts Access - To easily nominate your contact references.\nCamera Access - To scan your IDs to complete ID verification\n\n->ABOUT US\nPautang Cash is an online loan app philippines based on mobile tech and big data analysis. We provide simple, transparent and secured online lending services in Philippines. You can receive your peso cash loan at your preferred cash-out option. We help every Filipino who has lending need solve their cash lending problems - your trusted financial partner!\n\nPautang Cash is a product of Prima Fintech (Philippines) Lending Cooperation (SEC Registration No. CS201951100. CA No. 2917). Prima Fintech is a legally registered lending company in the Philippines, whose loan products comply with the local lending policies and regulations, and all lending business activities are subject to the policies.\n\nCompany address：north penthouse unit, 26th Street Corner 4th Avenue, Fort Bonifacio Taguig City, Fourth District, Philippines\nEmail: support@primafintech.net\n\n\n        more\n      \n",
        "rating": "4.6"
    }
}