{
    "rank": "76",
    "title": "Ourcash PH",
    "company": "    Whale Tail Lending Services",
    "url": "https://apps.apple.com/ph/app/ourcash-ph/id1588874425",
    "detail": {
        "description": "\n\nSa OurCash, pera natin ‘to!\n\n\n\nRequirements:\nAny functioning smartphone\nOurCash App\nOne (1) Valid ID\n\n\n\nHow do I Apply?\nDownload the OurCash App in App Store\nGo through the quick registration process\nVerify your identity\nWait for approval\n\n\n\nWhat do I need to register?\nJust upload one (1) VALID ID!\n\n\n\nWhat are the privacy and permission policies of OurCash PH?\n\nOurCash prioritizes your privacy. The submitted photo of your government-issued ID and other personal information will be used to verify your credit profile on our system. We will NEVER share any of your information without your direct consent or explicit permission.\n\n\n\nOn the app, we will require the following permissions to verify your identity:\nLocation Access - To auto-verify your address.\nContacts Access - To easily nominate your contact references.\nCamera Access - To scan your ID for complete ID verification\n\n\n\nHow safe are my personal details?\nAll personal details are fully secured and protected\nData Privacy Agreements are insisted upon registering\nRoutine assessments are done to ensure quality data protection\n\n\n\nHow fast is the approval and where can I receive the loan?\nApproval of loan application can take upto 5 minutes to 24 hours\nUpon approval, expect same-day disbursement through FastPay\nCash-out centers: RD Pawnshop and M Lhuillier\nOther withdrawal channels: Bank Transfer, GCash, GrabPay, Paymaya, and Coins.ph\n\n\n\nHow do I repay my loan?\nPayment can be partial or in full, as long as it is within the loan period\nYou may check your loan term duration on the app\nPay through our selected payment channels ONLY: RD Pawnshop, M Lhuillier, 7-Eleven, True Money, EC Pay, GCash, Paymaya, and ShopeePay\n\n\n\nWhat loan term packages do you offer?\nWe offer a variety of packages depending on your VIP Level\nLoan Amount: Php 2,000 - Php 20,000\nLoan Duration: 60 - 120 days\nMaximum APR: 20%\nTransaction fee: Php 0 - Php 150\nOther fees: Service fee from 10-20%\n\n\n\n\nPRODUCT INFORMATION\n-Amount:₱3,000-₱30,000\n-Term: 90days-360 days\n-Service fee: 3%-5%\n-Transfer Fee: ₱0-₱200\n-APR: 18%\n\n\n\n\nExample:\nLoan Amount: ₱ 20,000\nLoan Term:180-days\nwith Interest rate: 18%\nTransfer fee:  ₱ 0\nService fee is ₱ 600\nTotal service fee and interest will be ₱ 2,400 pesos.\nTotal received amount is ₱19,400\nNo monthly payment\nTotal repayment for 180 days is ₱ 21,800 (20,000*18%/360*180+20,000) only pay  on the due date.\n\n\n\n\n\n*Reminder: Always check the fees, charges, and the ‘Terms and Conditions’ of your loan offer before accepting your loan.\n\n\n\n\n\n\n\nWhy choose OurCash?\n\nOurCash offers all the basic features available in any other app:\nSimple and straightforward application process\nMultiple layers of account security\nFast and reliable cash disbursement\nRegular events and promos\n\n\n\nWhat sets OurCash apart from any other loaning app is that our upward movement is faster than any other app. Using our app allows you to increase your VIP level with just a few loan applications, giving you:\nIncreased Loan Amounts\nIncreased Loan Durations\nLower Processing Fees\n\n\n\nWhat are you waiting for? Download the APP now and be part of our OurCash Family!\n\n\nOurCash is a new online lending application tailored to provide Filipinos an accessible, reliable and safe loaning experience.\nSa OurCash, pera natin ‘to!\n\n\n\nContact Us\nFor questions, feedbacks, or concerns, please contact us at:\nWebsite: www.Ourcash.ph\nFacebook: https://www.facebook.com/ourcashph\nEmail: info@ourcash.ph\n\n\n\nPlease visit us on our Facebook Page for the latest updates to the OurCash FAQs\n\n\n\nAll loans under the OurCash App are financed by Horizon Plus Lending Services Corporation, with SEC Registration (under processing).\n\nIf you have any concerns regarding your data privacy, please contact us through privacy@ourcash.ph\n\n\n        more\n      \n",
        "rating": "3.1"
    }
}