{
    "rank": "87",
    "title": "PesoHaus",
    "company": "    Leapgen Lending INC.",
    "url": "https://apps.apple.com/ph/app/pesohaus/id1528923645",
    "detail": {
        "description": "\n\nPesoHaus is an online lending app provided by Leapgen Lending Inc. SEC Registration No. CS201915717. CA No. 3089. We strive to provide better loan services for Filipinos. Before making a loan transaction, please read and review the terms and conditions in the disclosure statement.\n\n\nAPP FEATURES:\nLoan period: 91 days (the shortest, including renewal time)-120 days (the longest, including\nUpdate time)\nLoanable amount: P2000-P12,000\nAnnual interest rate (APR): up to 20%\nCost: processing fee, service fee. The minimum is 10% and the maximum is 20%.\nFor example, the loan amount is P4000, the 91-day loan, the interest rate is 20%, and the repayment amount is P4199.45 (4000*20%/365*91+4000)\n\n\nPesoHaus is an online cash loan/lending app that caters to Filipinos. Unlike traditional lending companies, we provide fast and easy cash loan services. When you need urgent cash or additional fund, remember, PesoHaus will always be there for you, and we aim to provide the best loan experience ever.\n\nHow does it work?\n-Filipinos age 18 and older\nWhat are the requirements for application?\n-Valid Government ID\nFind PesoHaus on App Store (IOS)\n-Download and register with your phone number\n-provide your information\n-choose from several channels for disbursement\n\nAffordable and Transparent\nCredit should be as affordable and transparent as it is fast, easy, and secure to access.\nbuild your credit with PesoHaus for higher and fast cash loan amounts by paying back on time!\nSpecial Quality of PesoHaus Secure,\nYour privacy is very important to us. Verify your identity and submit all the requirements in the app with at least one (1) valid ID to complete your Credit Profile.\n\n\nFrequently Asked Questions\nPlease visit http://www.PesoHaus.com/\nApp concerns email us at: cs@pesohaus.com\nAddress: UNIT 1604, PRESTIGE TOWER, F. ORTIGAS JR. ROAD, ORTIGAS CENTER, PASIG,CITY, M. MLA\n\n\n        more\n      \n",
        "rating": "2.8"
    }
}