{
    "rank": "57",
    "title": "Madaliloan",
    "company": "    IPL INCORPORATED",
    "url": "https://apps.apple.com/ph/app/madaliloan/id1619918750",
    "detail": {
        "description": "\n\nmadaliloan-cash loan and online loans app,you can pera loan through loan app.It is a Filipino technology and financial services company. We provide Filipinos with safe, easy cash loans online, to help every Filipino solve their financial problems.\n\nProduction\nLow interest and flexible repayment.\nLoan term: 91 days - 120 days\nThe loan amount we here offer is at P3000 - P12,000. As for the actual loan amount, it can be adjust depending on your own need.\nFlexible loan term option with interest starting from 1%.\nLoan interest: up to 14%/year (APR)\nTransaction fee: zero\nFor example, if you choose a loan limit of P5000 with a period of 1 year,you total must be paid: P5000*14%+P5000=P5700\n\nUser Requirements\n• Filipino Citizen\n• Age : 18+\nWhat are you waiting for? Millions of madaliloan customers got their cash to start their business, pay the education fee and fulfill their financial needs.madaliloan provides easy online loan service in every borrowers. No paperwork needed. No collateral and no bank account required.\nProduct features:\n• Simple application, only 3 easy steps.\n• Safe and convenient, we protect and secure your information, you can apply anytime and anywhere.\nApplication procedure:\n• Download the madaliloan app in your mobile phone.\n• Fill in simple application information\n• Fill in your Bank Card or cash withdrawal options.\n• Get your cash sent directly to Gcash, Bank Account., etc How much can I get?\n• madaliloan will borrow from Php 1,000 - 3,000 for the first time loan applicant.\n• You can extend your credit limit up to Php 20,000 with on time repayment records.\n• Cash out from thousands of locations, including Gcash, Cebuana Lhuillier, M Lhuillier, LBC, or your own bank account., etc\nHow to repay ?\n• Visit any 7-Eleven, Cebuana Lhuillier, M Lhuillier, or bank.\n• Easy repayment schedule keeps you on track with your repayment.Why madaliloan?\n• Easy application and fast approval process. You get cash as soon as possible.\n• To provide financial ideas in helping you to save and spend money wisely.\n• Millions of madaliloan customers cases may inspire your journey.\n• Fast and simple, lowest interest rate.\n• Good staff and good customer service.\n• Transparent and responsible.\n• Regular customers got a special offer.\n\nCONTACT US\nEmail: Madaliloan2020@gmail.com\n\n\n        more\n      \n",
        "rating": "3.8"
    }
}