{
    "rank": "19",
    "title": "BluePeso - Safe cash loan app",
    "company": "    Copperstone Lending Inc.",
    "url": "https://apps.apple.com/ph/app/bluepeso-safe-cash-loan-app/id1611524035",
    "detail": {
        "description": "\n\nBluePeso is a digital platform for your cash loan service. We know you have plans and priorities and we want to help you achieve your goal by providing financial support with less waiting time. Our aim is to promote a modern way of loan application in a smooth transaction, away from long lines and crowded places. We want to eliminate the old-fashioned way and diverse it into a new customer experience. We made a quicker process for our users where you can process in just 5 minutes. No need to be overwhelmed with requirements because with us you will just need 1 ID for a successful application. Yes, you heard it right! We are also an SEC-approved organization that highly protects our customer privacy in all manners.Start your application now!\n\nProduct Information:\nLoan amount: ₱2,000.00 - ₱ 10,000.00\nPayment duration: minimum 180 days and maximum 365 days\nAPR (Annual Interest Rate): 10% - 20%\nService Fee: it's a one-time service fee charged from 5%-10%, which will be deducted on your loan amount during disbursement.\nWe want to promote service transparency. We guarantee that there will be no other charges not stated above.\n\nLoan case sample reference:\nLoan amount: ₱2,000\nLoan payment duration: 180 days upon application approval\nAPR: 10%\nService Fee: 10%\nNo other fees will be charged.\nCase sample computation reference:\nService fee: ₱2,000*10% = ₱200\nAmount in hand: ₱2,000-₱200=₱1,800\nInterest fee: ₱2,000*10%*180/365=₱99\nTotal payable amount: ₱2,000+₱99=₱2,099\nMonthly payment: ₱2,099/6=350\n\nHow to qualify?\nBe a Filipino citizen\nBe 18 years old and older\nHave government issued IDs (we only require one)\n\nWhat is the application process?\n1.Download BluePeso in App Store and Install it\n2.Sign up with your mobile number for free\n3.Fill out the simple forms to proceed with your application\n4.Get approved and loan disbursed immediately\n\nHow to make payment?\nGo to our app and select any of the repayment options:\nOffline stores: M Lhuillier/RD Pawnshop/7-11/etc.\nE- wallets: GCash/Paymaya\n\nCompany Information\nCompany name: Copperstone Lending Inc.\nSEC Registration No. 2021050012959-04\nCERTIFICATE OF AUTHORITY NO.3454\nNote: Please study the terms and conditions of the Disclosure Statement before proceeding with the loan\n\nAddress:\nThe Penthouse, Marajo Tower, 26th st. Cor. 4th Ave. Bonifacio Global City 312 Metro Manila Fort Bonifacio, Taguig City, Fourth District, National Capital Region (NCR), 1634\nEmail: IRVINGBALDUR@outlook.com\n\n\n        more\n      \n",
        "rating": "4.4"
    }
}