{
    "rank": "3",
    "name": "BCA mobile",
    "company": "PT. Bank Central Asia Tbk",
    "url": "https://apps.apple.com/id/app/bca-mobile/id551587254",
    "detail": {
        "description": "\n\nBank on the go with BCA mobile app. Conduct non-cash transactions using BCA mobile banking (m-BCA) and BCA internet banking (KlikBCA Smartphone) whenever, wherever.\n\nm-BCA Benefits\n1. No SIM card changes\nm-BCA transactions are available through all GSM operators, including Telkomsel, XL Axiata, Indosat, Axis, and Three\n2. Low transactions cost\nReduce unnecessary cost using GPRS/EDGE/3G/WIFI internet connection\n3. Payment Data Storage\nm-BCA’s storage feature enables you to conduct repeat transactions without having to input the data all over again\n4. Transfer Data\nm-BCA saves your transfer activities--whether you’re sending funds between BCA accounts or to other banks—to a list for a time-saving and reliable banking experience\n5. Practical and Easy to Use\nRecipient company or banking code is not required for payment and transfer transactions.\n\nFor BCA mobile users, can enjoy the latest services as follows:\n1. Block BCA ATM Card or BCA Credit Card facility through m-Admin menu\n2. BCA Credit Card Activation feature through menu m-Admin ->Credit Card Activation\n3. BCA Credit Card PIN Make / change facility via m-Admin menu ->Create / Change PIN.\n4. Cardless Transaction feature through Setor Tarik menu ->Cash withdrawal and cash deposit.\n5. Transfer without hassle through QR menu ->Send or receive money using QR\nFor the time being, Cardless Transactions can be made at these following ATMs (www.bca.co.id/ATMtanpakartu)\n\nKlikBCA\nEasy to access KlikBCA smartphone version smartphone https://m.klikbca.com with just one click\n\nInfo BCA\nhttps://www.bca.co.id/id/Individu/Produk/E-Banking/Info-BCA\n\nOpen New Account\nNow you can open bank account anywhere just with your mobile phone. What you need to do to get your bank account is only by providing e-KTP, completing the form, and doing video call with our Customer Service Officer through BCA mobile application. After you done, you’ll get the success notification of your opening account; you might need to directly activate your mobile banking service (by creating PIN number for transaction) and deposit money to your account. Then you are ready to do any transaction with your BCA mobile application (m-BCA menu). You will also get KlikBCA account the day after you succeed creating your mobile banking PIN via email.\n\nFor further assistant, call halo bca at 1500888 via cellular phone\n\nEnjoy using the BCA mobile.\n\n\n        more\n      \n",
        "rating": "3.4"
    }
}