{
    "rank": "2",
    "name": "BRImo BRI",
    "company": "PT. Bank Rakyat Indonesia (Persero) Tbk.",
    "url": "https://apps.apple.com/id/app/brimo-bri/id1439730817",
    "detail": {
        "description": "\n\nBRImo merupakan Aplikasi Internet dan Mobile Banking BRI Terbaru berbasis data internet yang memberikan kemudahan bagi nasabah maupun non nasabah BRI untuk dapat bertransaksi dengan User Interface dan User Experience terbaru dan fitur-fitur menarik lainnya dengan pilihan Source of Fund/ sumber dana setiap transaksi dapat menggunakan rekening Giro/ Tabungan.  BRImo versi terbaru memiliki beberapa keunggulan diantaranya :\n\n1. Redesign UI/UX BRImo\n\nPerubahan design ini bertujuan untuk memberikan penyegaran tampilan dan experience baru dengan dengan mengedepankan kemudahan dan kenyamanan bertransaksi.\n\n2. Kelengkapan Fitur\n\nBRImo akan melakukan penyempurnaan fitur dari seluruh channel di ATM, IBanking Web, SMS Banking dan IBanking Mobile serta akan memperluas kerja sama dengan biller-biller agregator untuk menjawab kebutuhan nasabah dalam bertransaksi di BRI.\n\n3. Buka Rekening (Digital Saving)\n\nSaat ini calon nasabah BRI dapat membuka rekening melalui aplikasi BRImo dengan meng-upload data diri serta mengirimkan video sebagai bentuk Know Your Customer (KYC) dalam pembentukan rekening. Dengan membuka rekening melalui BRImo, nasabah juga akan teregistrasi Brimo dengan fasilitas finansial.\n\n4. Registrasi Internet Banking\n\nSaat ini nasabah baru dan nasabah eksiting yang belum teregistrasi internet banking dapat melakukan registrasi internet banking dengan fasilitas financial melalui aplikasi BRImo. Registrasi internet banking ini cukup dilakukan melalui aplikasi BRImo tanpa harus ke unit kerja BRI.\n\n5. Personal Financial Management (PFM)\n\nFitur PFM akan digunakan untuk membantu nasabah dalam menginformasikan jumlah pemasukan dan pengeluaran yang dilakukan selama bertransaksi menggunakan channel BRI.\n\n6. Menghadirkan fitur yang berisikan fitur-fitur sehari-hari yang biasa digunakan oleh nasabah Bank BRI.\n\nFitur fast menu ini digunakan untuk menyasar pengguna yang sudah nyaman dengan Mobile Banking berbasis SMS. Fitur ini juga dilengkapi dengan adanya quick balance dimana nasabah dapat mengetahui saldo rekening utama dengan cara singkat.\n\n\n        more\n      \n",
        "rating": "4.7"
    }
}